-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/sacks/Projects/VaccSideEffects/output/logs/explore_persiste
> nce.log
  log type:  text
 opened on:  27 Jan 2026, 10:57:53
.     di "=== Running in batch mode: $scriptname ==="
=== Running in batch mode: explore_persistence ===
.     di "Log: output/logs/$scriptname.log"
Log: output/logs/explore_persistence.log
.     di ""

. }

. 
end of do-file

. 
. /*---------------------------------------------------------------------------
> ---
>     1. Define controls
> -----------------------------------------------------------------------------
> -*/
. 
. do "code/_set_controls.do"

. /*===========================================================================
> ===
>     Control Variables Definition
> 
>     Include this file in do-files that run regressions with control variables
> .
>     Sets globals: prior_beliefs, vacc_experience, demographics, controls
> =============================================================================
> =*/
. 
. * Prior beliefs from main survey
. global prior_beliefs "i.prior_self_placebo i.prior_self_vacc"

. 
. * Vaccine experiences from prescreen
. global vacc_experience "had_prior_covid_vacc had_prior_flu_vacc i.covid_vacc_
> reaction i.flu_vacc_reaction"

. 
. * Demographics from main survey
. global demographics "i.age i.gender i.education i.income i.race i.ethnicity i
> .polviews"

. 
. * All controls combined
. global controls "$prior_beliefs i.pre_vacc_intent $vacc_experience $demograph
> ics i.trust_govt cond_*"

. 
end of do-file

. 
. /*---------------------------------------------------------------------------
> ---
>     2. Load data and prepare variables
> -----------------------------------------------------------------------------
> -*/
. 
. use "derived/merged_all.dta", clear

. 
. * Sample indicators
. gen se_sample = guess_vaccine ~= -99 & guess_placebo ~= -99 & ///
>         in_followup & ~missing(guess_vaccine) & ~missing(guess_placebo)

. 
. egen recall_miss = rowmiss(recall_gavi recall_manufacturer recall_university)

. gen invalid_miss = in_followup & inlist(recall_study, 1, 3) & recall_miss

. gen recall_sample = in_followup & ~invalid_miss

. 
. * Recall outcome variables
. gen yes_recall_study = 1.recall_study
(525 missing values generated)

. gen yes_recall_manu = 1.recall_manufacturer
(1,014 missing values generated)

. gen yes_recall_uni = 1.recall_university
(1,014 missing values generated)

. gen yes_recall_gavi = 1.recall_gavi
(1,014 missing values generated)

. 
. * Adverse event rate guess
. gen guess_delta = guess_vaccine - guess_placebo
(538 missing values generated)

. 
. * Label treatment indicators
. label var arm_industry "Industry"

. label var arm_academic "Academic"

. label var arm_personal "Personal"

. 
. local keyvars arm_industry arm_academic arm_personal

. 
. /*---------------------------------------------------------------------------
> ---
>     3. Attrition table
> -----------------------------------------------------------------------------
> -*/
. 
. eststo clear

. 
. foreach y in in_followup recall_sample se_sample {
  2.     regress `y' `keyvars' $controls, robust
  3.     sum `y' if arm_control==1
  4.     estadd scalar cm = r(mean)
  5.     eststo m_`y'
  6. }
note: 3.covid_vacc_reaction omitted because of collinearity.
note: 3.flu_vacc_reaction omitted because of collinearity.

Linear regression                               Number of obs     =      3,516
                                                F(65, 3450)       =       3.34
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0345
                                                Root MSE          =     .33635

------------------------------------------------------------------------------
             |               Robust
 in_followup | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
arm_industry |   .0178319   .0160671     1.11   0.267      -.01367    .0493339
arm_academic |   .0074897   .0165002     0.45   0.650    -.0248615    .0398408
arm_personal |   .0016408   .0165031     0.10   0.921    -.0307161    .0339977
             |
prior_self~o |
2. Very u..  |   .0006206   .0162348     0.04   0.970    -.0312102    .0324515
3. Somewh..  |    .003618   .0204151     0.18   0.859    -.0364089    .0436448
4. Neithe..  |  -.0020389   .0281897    -0.07   0.942     -.057309    .0532313
5. Somewh..  |  -.0169748   .0219028    -0.78   0.438    -.0599185     .025969
6. Very l..  |  -.0190458   .0299381    -0.64   0.525     -.077744    .0396523
7. Would ..  |   .0146503   .0439742     0.33   0.739    -.0715677    .1008683
             |
prior_self~c |
2. Very u..  |   .0880579   .0438473     2.01   0.045     .0020887    .1740271
3. Somewh..  |   .0745858    .043655     1.71   0.088    -.0110064     .160178
4. Neithe..  |   .0628394   .0455221     1.38   0.168    -.0264136    .1520925
5. Somewh..  |   .0481366   .0424266     1.13   0.257    -.0350471    .1313204
6. Very l..  |   .0784851   .0433717     1.81   0.070    -.0065517     .163522
7. Would ..  |   .0902866   .0466926     1.93   0.053    -.0012614    .1818345
             |
pre_vacc_i~e |
2. May or..  |  -.0048497    .013886    -0.35   0.727    -.0320752    .0223759
had_p~d_vacc |  -.0417865   .0240793    -1.74   0.083    -.0889976    .0054246
had_p~u_vacc |   .0047119   .0265309     0.18   0.859     -.047306    .0567298
             |
covid_vacc~n |
1. None/d..  |    .073839   .0246639     2.99   0.003     .0254817    .1221964
2. Mild ..)  |   .0591683   .0241877     2.45   0.014     .0117445     .106592
  3. Severe  |          0  (omitted)
             |
flu_vacc_r~n |
1. None/d..  |  -.0215782   .0281822    -0.77   0.444    -.0768337    .0336773
2. Mild ..)  |  -.0009104   .0281315    -0.03   0.974    -.0560665    .0542457
  3. Severe  |          0  (omitted)
             |
         age |
   3. 35-49  |    .058287   .0144744     4.03   0.000     .0299077    .0866664
   4. 50-64  |   .0775956   .0167077     4.64   0.000     .0448375    .1103537
   5. 65-74  |   .0960852   .0259344     3.70   0.000     .0452368    .1469336
     6. 75+  |  -.0642251   .0714873    -0.90   0.369    -.2043867    .0759365
             |
      gender |
  2. Female  |  -.0292156   .0121287    -2.41   0.016    -.0529957   -.0054355
   3. Other  |  -.1006516   .0713171    -1.41   0.158    -.2404796    .0391763
4. Prefer..  |   .0456248   .0844637     0.54   0.589     -.119979    .2112287
             |
   education |
      2. HS  |   .0773747   .0928972     0.83   0.405    -.1047644    .2595137
3. Some c..  |   .1086127   .0921556     1.18   0.239    -.0720723    .2892977
4. 4-year..  |   .0854286   .0923885     0.92   0.355     -.095713    .2665702
5. More t..  |    .126065   .0932048     1.35   0.176     -.056677    .3088071
6. Prefer..  |   .2125496   .0997955     2.13   0.033     .0168853    .4082139
             |
      income |
 2. $25-50k  |   .0065027   .0193781     0.34   0.737    -.0314911    .0444964
 3. $50-75k  |  -.0110487   .0203492    -0.54   0.587    -.0509464    .0288489
4. $75-100k  |  -.0176886   .0217745    -0.81   0.417    -.0603809    .0250037
  5. >$100k  |  -.0239208   .0214828    -1.11   0.266    -.0660411    .0181995
6. Prefer..  |  -.0191093   .0422502    -0.45   0.651    -.1019471    .0637286
             |
        race |
   2. Black  |  -.0347089   .0187867    -1.85   0.065     -.071543    .0021253
   3. Asian  |   .1095864   .0456971     2.40   0.017     .0199904    .1991824
4. Am Ind..  |   .0659075   .0215759     3.05   0.002     .0236046    .1082104
5. Pacifi..  |  -.1936499   .1853155    -1.04   0.296    -.5569891    .1696893
   6. Other  |   .0611035   .0305729     2.00   0.046     .0011608    .1210463
7. Prefer..  |   .2004596   .0379101     5.29   0.000     .1261312    .2747881
             |
   ethnicity |
      2. No  |   .0163503   .0222938     0.73   0.463    -.0273601    .0600606
3. Prefer..  |  -.0727292   .0947354    -0.77   0.443    -.2584722    .1130139
             |
    polviews |
 2. Liberal  |   .0035383   .0231543     0.15   0.879    -.0418592    .0489358
3. Slight..  |  -.0118999   .0256781    -0.46   0.643    -.0622457     .038446
4. Moderate  |  -.0102694   .0232429    -0.44   0.659    -.0558406    .0353019
5. Slight..  |  -.0153933   .0267735    -0.57   0.565    -.0678867    .0371001
6. Conser..  |   .0136618   .0239761     0.57   0.569     -.033347    .0606705
7. Very c..  |   .0041766   .0300289     0.14   0.889    -.0546996    .0630527
8. Prefer..  |   -.018781   .0582784    -0.32   0.747    -.1330447    .0954826
             |
  trust_govt |
2. Somewh..  |  -.0033581   .0214237    -0.16   0.875    -.0453625    .0386464
3. Neithe..  |  -.0028692   .0207757    -0.14   0.890    -.0436032    .0378647
4. Somewh..  |  -.0031739   .0206456    -0.15   0.878    -.0436527    .0373049
5. Strong..  |   .0323194   .0242663     1.33   0.183    -.0152583     .079897
             |
 cond_asthma |   .0612286   .0334021     1.83   0.067    -.0042613    .1267185
   cond_lung |  -.0062515    .057973    -0.11   0.914    -.1199164    .1074133
  cond_heart |   .0664014   .0436642     1.52   0.128    -.0192089    .1520116
cond_diabe~s |   .0274437   .0304433     0.90   0.367    -.0322451    .0871324
 cond_kidney |   .0192581   .0549234     0.35   0.726    -.0884275    .1269437
cond_rathe~y |    .034907   .0992282     0.35   0.725    -.1596449    .2294589
   cond_none |   .0471365   .0341395     1.38   0.167    -.0197992    .1140722
       _cons |   .6124438   .1115523     5.49   0.000     .3937286    .8311591
------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
 in_followup |        885    .8576271    .3496298          0          1

added scalar:
                 e(cm) =  .85762712
note: 3.covid_vacc_reaction omitted because of collinearity.
note: 3.flu_vacc_reaction omitted because of collinearity.

Linear regression                               Number of obs     =      3,516
                                                F(65, 3450)       =       3.42
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0331
                                                Root MSE          =     .33932

------------------------------------------------------------------------------
             |               Robust
recall_sam~e | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
arm_industry |    .020448   .0161896     1.26   0.207    -.0112941    .0521901
arm_academic |   .0078629   .0166702     0.47   0.637    -.0248215    .0405473
arm_personal |   .0028495   .0166523     0.17   0.864    -.0297998    .0354989
             |
prior_self~o |
2. Very u..  |  -.0009311   .0162782    -0.06   0.954     -.032847    .0309848
3. Somewh..  |  -.0004915   .0205473    -0.02   0.981    -.0407775    .0397945
4. Neithe..  |   -.001693   .0282101    -0.06   0.952    -.0570033    .0536172
5. Somewh..  |  -.0241132   .0221896    -1.09   0.277    -.0676193    .0193929
6. Very l..  |  -.0249673   .0302627    -0.83   0.409    -.0843019    .0343672
7. Would ..  |   .0117466    .044043     0.27   0.790    -.0746063    .0980995
             |
prior_self~c |
2. Very u..  |   .0815694   .0438688     1.86   0.063    -.0044421     .167581
3. Somewh..  |   .0754285   .0435916     1.73   0.084    -.0100395    .1608965
4. Neithe..  |   .0592919   .0456231     1.30   0.194    -.0301592    .1487429
5. Somewh..  |   .0466292   .0423702     1.10   0.271     -.036444    .1297023
6. Very l..  |    .075674   .0433726     1.74   0.081    -.0093644    .1607125
7. Would ..  |   .0905712   .0466557     1.94   0.052    -.0009044    .1820469
             |
pre_vacc_i~e |
2. May or..  |  -.0028079   .0140381    -0.20   0.841    -.0303317    .0247159
had_p~d_vacc |  -.0432766   .0242592    -1.78   0.075    -.0908405    .0042874
had_p~u_vacc |    .005399   .0265472     0.20   0.839    -.0466507    .0574488
             |
covid_vacc~n |
1. None/d..  |   .0731822   .0248719     2.94   0.003     .0244171    .1219473
2. Mild ..)  |   .0602852   .0244008     2.47   0.014     .0124438    .1081266
  3. Severe  |          0  (omitted)
             |
flu_vacc_r~n |
1. None/d..  |  -.0236168   .0282167    -0.84   0.403      -.07894    .0317063
2. Mild ..)  |  -.0023711   .0281554    -0.08   0.933    -.0575742    .0528319
  3. Severe  |          0  (omitted)
             |
         age |
   3. 35-49  |   .0550253   .0146621     3.75   0.000     .0262779    .0837726
   4. 50-64  |   .0772666   .0168015     4.60   0.000     .0443247    .1102084
   5. 65-74  |   .0977558   .0260275     3.76   0.000     .0467249    .1487867
     6. 75+  |  -.0705133   .0708381    -1.00   0.320     -.209402    .0683755
             |
      gender |
  2. Female  |   -.028739   .0122155    -2.35   0.019    -.0526893   -.0047887
   3. Other  |  -.0959704   .0713315    -1.35   0.179    -.2358266    .0438859
4. Prefer..  |   .0448154   .0847038     0.53   0.597    -.1212593    .2108902
             |
   education |
      2. HS  |   .0763309   .0932908     0.82   0.413    -.1065799    .2592416
3. Some c..  |   .1071292   .0925388     1.16   0.247    -.0743071    .2885656
4. 4-year..  |   .0827818   .0927775     0.89   0.372    -.0991226    .2646863
5. More t..  |   .1220601   .0936005     1.30   0.192    -.0614578    .3055781
6. Prefer..  |   .2128669   .0995362     2.14   0.033      .017711    .4080227
             |
      income |
 2. $25-50k  |   .0038208   .0195594     0.20   0.845    -.0345284      .04217
 3. $50-75k  |  -.0101248   .0205554    -0.49   0.622    -.0504267    .0301771
4. $75-100k  |  -.0139058   .0219066    -0.63   0.526     -.056857    .0290453
  5. >$100k  |  -.0215764   .0216596    -1.00   0.319    -.0640433    .0208905
6. Prefer..  |  -.0166548   .0424018    -0.39   0.695    -.0997899    .0664804
             |
        race |
   2. Black  |  -.0375416   .0190227    -1.97   0.049    -.0748384   -.0002447
   3. Asian  |   .1086598   .0456077     2.38   0.017     .0192389    .1980807
4. Am Ind..  |   .0627127   .0220416     2.85   0.004     .0194967    .1059286
5. Pacifi..  |  -.1885149   .1850573    -1.02   0.308     -.551348    .1743181
   6. Other  |    .053984   .0311994     1.73   0.084    -.0071872    .1151552
7. Prefer..  |   .2008196   .0380536     5.28   0.000     .1262097    .2754296
             |
   ethnicity |
      2. No  |   .0163554   .0223792     0.73   0.465    -.0275225    .0602332
3. Prefer..  |  -.0731199   .0953351    -0.77   0.443    -.2600388    .1137991
             |
    polviews |
 2. Liberal  |   .0102247   .0235412     0.43   0.664    -.0359314    .0563808
3. Slight..  |  -.0086268   .0260635    -0.33   0.741    -.0597284    .0424747
4. Moderate  |   -.006576   .0236037    -0.28   0.781    -.0528546    .0397025
5. Slight..  |  -.0156705   .0272324    -0.58   0.565    -.0690638    .0377229
6. Conser..  |   .0149928    .024385     0.61   0.539    -.0328177    .0628033
7. Very c..  |   .0027425   .0304934     0.09   0.928    -.0570446    .0625295
8. Prefer..  |  -.0148372    .058465    -0.25   0.800    -.1294667    .0997924
             |
  trust_govt |
2. Somewh..  |  -.0070431   .0215016    -0.33   0.743    -.0492003    .0351141
3. Neithe..  |  -.0033024   .0207837    -0.16   0.874    -.0440521    .0374472
4. Somewh..  |  -.0069401   .0207149    -0.34   0.738    -.0475548    .0336747
5. Strong..  |   .0231814   .0246928     0.94   0.348    -.0252326    .0715953
             |
 cond_asthma |   .0632518   .0336132     1.88   0.060    -.0026521    .1291556
   cond_lung |  -.0042927   .0579292    -0.07   0.941    -.1178718    .1092863
  cond_heart |   .0707305   .0436841     1.62   0.106    -.0149189    .1563799
cond_diabe~s |   .0260298   .0305332     0.85   0.394    -.0338351    .0858947
 cond_kidney |   .0251324   .0549017     0.46   0.647    -.0825107    .1327754
cond_rathe~y |   .0407723   .0995503     0.41   0.682    -.1544112    .2359559
   cond_none |   .0501945   .0343863     1.46   0.144    -.0172251    .1176141
       _cons |   .6149124   .1119199     5.49   0.000     .3954764    .8343484
------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
recall_sam~e |        885    .8542373    .3530677          0          1

added scalar:
                 e(cm) =  .85423729
note: 3.covid_vacc_reaction omitted because of collinearity.
note: 3.flu_vacc_reaction omitted because of collinearity.

Linear regression                               Number of obs     =      3,516
                                                F(65, 3450)       =       3.00
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0324
                                                Root MSE          =     .35474

------------------------------------------------------------------------------
             |               Robust
   se_sample | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
arm_industry |   .0275477   .0169224     1.63   0.104    -.0056312    .0607266
arm_academic |   .0080056    .017523     0.46   0.648    -.0263509    .0423621
arm_personal |   .0070943   .0174377     0.41   0.684    -.0270949    .0412834
             |
prior_self~o |
2. Very u..  |  -.0009871   .0170448    -0.06   0.954     -.034406    .0324317
3. Somewh..  |    .007269   .0213186     0.34   0.733    -.0345293    .0490673
4. Neithe..  |   -.017499   .0307409    -0.57   0.569    -.0777711    .0427732
5. Somewh..  |  -.0209371   .0230338    -0.91   0.363    -.0660984    .0242241
6. Very l..  |     -.0277   .0311813    -0.89   0.374    -.0888357    .0334356
7. Would ..  |   .0235962   .0445288     0.53   0.596    -.0637092    .1109016
             |
prior_self~c |
2. Very u..  |   .0796202   .0450048     1.77   0.077    -.0086186    .1678591
3. Somewh..  |   .0626125   .0448976     1.39   0.163    -.0254162    .1506411
4. Neithe..  |   .0591705   .0470013     1.26   0.208    -.0329828    .1513237
5. Somewh..  |   .0360481   .0435773     0.83   0.408    -.0493918     .121488
6. Very l..  |   .0772502   .0445195     1.74   0.083     -.010037    .1645374
7. Would ..  |   .0904385   .0481829     1.88   0.061    -.0040315    .1849085
             |
pre_vacc_i~e |
2. May or..  |  -.0089892   .0145633    -0.62   0.537    -.0375427    .0195643
had_p~d_vacc |  -.0450513   .0250659    -1.80   0.072    -.0941967    .0040942
had_p~u_vacc |   .0041249   .0275622     0.15   0.881    -.0499149    .0581648
             |
covid_vacc~n |
1. None/d..  |   .0793602   .0256241     3.10   0.002     .0291202    .1296002
2. Mild ..)  |   .0568008   .0252522     2.25   0.025     .0072901    .1063115
  3. Severe  |          0  (omitted)
             |
flu_vacc_r~n |
1. None/d..  |  -.0231764   .0293092    -0.79   0.429    -.0806414    .0342887
2. Mild ..)  |   .0000851   .0293387     0.00   0.998    -.0574379    .0576082
  3. Severe  |          0  (omitted)
             |
         age |
   3. 35-49  |   .0565997   .0150705     3.76   0.000     .0270518    .0861477
   4. 50-64  |    .068845   .0177857     3.87   0.000     .0339734    .1037167
   5. 65-74  |   .1015215   .0278127     3.65   0.000     .0469905    .1560525
     6. 75+  |  -.0322514   .0797081    -0.40   0.686    -.1885312    .1240283
             |
      gender |
  2. Female  |  -.0310433   .0127519    -2.43   0.015    -.0560453   -.0060413
   3. Other  |  -.0894118   .0716241    -1.25   0.212    -.2298417    .0510181
4. Prefer..  |   .0358418   .0881565     0.41   0.684    -.1370025     .208686
             |
   education |
      2. HS  |   .1155475   .1006291     1.15   0.251     -.081751    .3128461
3. Some c..  |   .1472358   .1000123     1.47   0.141    -.0488535    .3433252
4. 4-year..  |   .1256165    .100251     1.25   0.210    -.0709409    .3221738
5. More t..  |   .1539586   .1011326     1.52   0.128    -.0443272    .3522444
6. Prefer..  |   .2621106   .1071181     2.45   0.014     .0520894    .4721319
             |
      income |
 2. $25-50k  |    .000081   .0203208     0.00   0.997    -.0397609     .039923
 3. $50-75k  |  -.0164797   .0214463    -0.77   0.442    -.0585284     .025569
4. $75-100k  |  -.0141824   .0227571    -0.62   0.533    -.0588011    .0304363
  5. >$100k  |  -.0204858   .0224392    -0.91   0.361    -.0644812    .0235096
6. Prefer..  |  -.0408629    .046723    -0.87   0.382    -.1324705    .0507447
             |
        race |
   2. Black  |  -.0412055    .019888    -2.07   0.038    -.0801989   -.0022121
   3. Asian  |   .1151996   .0458961     2.51   0.012     .0252133    .2051859
4. Am Ind..  |   .0782282   .0220784     3.54   0.000     .0349401    .1215162
5. Pacifi..  |   -.169024   .1880619    -0.90   0.369     -.537748       .1997
   6. Other  |   .0652422   .0315191     2.07   0.039     .0034443    .1270401
7. Prefer..  |    .164629   .0659309     2.50   0.013     .0353615    .2938965
             |
   ethnicity |
      2. No  |   .0071844   .0229638     0.31   0.754    -.0378396    .0522083
3. Prefer..  |  -.0444503   .1017907    -0.44   0.662    -.2440264    .1551257
             |
    polviews |
 2. Liberal  |   .0010323   .0242858     0.04   0.966    -.0465838    .0486483
3. Slight..  |  -.0215896   .0269868    -0.80   0.424    -.0745013    .0313221
4. Moderate  |    -.01329   .0242295    -0.55   0.583    -.0607956    .0342157
5. Slight..  |  -.0242892   .0279372    -0.87   0.385    -.0790643    .0304858
6. Conser..  |   .0024942   .0251276     0.10   0.921    -.0467724    .0517607
7. Very c..  |  -.0178636   .0319979    -0.56   0.577    -.0806003    .0448731
8. Prefer..  |  -.0303469   .0650564    -0.47   0.641    -.1578999     .097206
             |
  trust_govt |
2. Somewh..  |  -.0059565   .0224454    -0.27   0.791    -.0499642    .0380511
3. Neithe..  |  -.0043813   .0217657    -0.20   0.840    -.0470563    .0382938
4. Somewh..  |  -.0036867   .0217547    -0.17   0.865    -.0463401    .0389666
5. Strong..  |   .0136996   .0263046     0.52   0.603    -.0378745    .0652737
             |
 cond_asthma |   .0787009   .0347102     2.27   0.023     .0106463    .1467554
   cond_lung |  -.0046757   .0634314    -0.07   0.941    -.1290425    .1196912
  cond_heart |   .0724642   .0452462     1.60   0.109    -.0162478    .1611762
cond_diabe~s |   .0456557     .03155     1.45   0.148    -.0162028    .1075142
 cond_kidney |   .0180398   .0573599     0.31   0.753    -.0944229    .1305025
cond_rathe~y |   .0751281   .1006026     0.75   0.455    -.1221186    .2723748
   cond_none |   .0654974   .0357411     1.83   0.067    -.0045785    .1355733
       _cons |   .5715658   .1187737     4.81   0.000     .3386918    .8044397
------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
   se_sample |        885    .8350282    .3713649          0          1

added scalar:
                 e(cm) =  .83502825

. 
. local coltitles mtitles("In Followup" "Recall Sample" "SE Sample")

. 
. esttab m_in_followup m_recall_sample m_se_sample ///
>     using output/tables/persistence_attrition.tex, ///
>     b(%9.3f) se(%9.3f) keep(`keyvars') label nostar ///
>     stats(cm N, labels("Control mean" "N") fmt(%9.3f %9.0fc)) ///
>     fragment replace nomtitles nonotes nonumbers nolines nogaps
(output written to output/tables/persistence_attrition.tex)

. 
. esttab m_in_followup m_recall_sample m_se_sample ///
>     using output/tables/persistence_attrition.md, ///
>     b(%9.3f) se(%9.3f) keep(`keyvars') label nostar `coltitles' ///
>     stats(cm N, labels("Control mean" "N") fmt(%9.3f %9.0fc)) ///
>     fragment replace nonotes nonumbers
(output written to output/tables/persistence_attrition.md)

. 
. /*---------------------------------------------------------------------------
> ---
>     4. Recall table
> -----------------------------------------------------------------------------
> -*/
. 
. eststo clear

. 
. foreach y in yes_recall_study yes_recall_manu yes_recall_uni yes_recall_gavi 
> {
  2.     regress `y' `keyvars' $controls if recall_sample, robust
  3.     sum `y' if arm_control==1 & recall_sample
  4.     estadd scalar cm = r(mean)
  5.     eststo m_`y'
  6. }
note: 3.covid_vacc_reaction omitted because of collinearity.
note: 3.flu_vacc_reaction omitted because of collinearity.

Linear regression                               Number of obs     =      2,995
                                                F(65, 2929)       =       1.95
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0351
                                                Root MSE          =     .43073

------------------------------------------------------------------------------
             |               Robust
yes_recall~y | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
arm_industry |  -.0076574   .0222685    -0.34   0.731    -.0513208    .0360061
arm_academic |   .0182263   .0229578     0.79   0.427    -.0267887    .0632413
arm_personal |   .0165584   .0224422     0.74   0.461    -.0274456    .0605625
             |
prior_self~o |
2. Very u..  |   .0230768   .0223003     1.03   0.301    -.0206491    .0668026
3. Somewh..  |   .0341344   .0286239     1.19   0.233    -.0219905    .0902593
4. Neithe..  |   .0652938   .0381927     1.71   0.087    -.0095936    .1401811
5. Somewh..  |   .0252238   .0296743     0.85   0.395    -.0329608    .0834084
6. Very l..  |   .0096627   .0409729     0.24   0.814    -.0706759    .0900013
7. Would ..  |   -.026035   .0638705    -0.41   0.684    -.1512706    .0992007
             |
prior_self~c |
2. Very u..  |  -.0123043   .0543516    -0.23   0.821    -.1188756     .094267
3. Somewh..  |   .0133884   .0540051     0.25   0.804    -.0925034    .1192802
4. Neithe..  |  -.0722511   .0560774    -1.29   0.198    -.1822063    .0377041
5. Somewh..  |  -.0129072   .0521375    -0.25   0.804    -.1151371    .0893228
6. Very l..  |   .0222847   .0545022     0.41   0.683    -.0845818    .1291513
7. Would ..  |   .0128397   .0607887     0.21   0.833    -.1063532    .1320326
             |
pre_vacc_i~e |
2. May or..  |  -.0163768   .0190996    -0.86   0.391    -.0538267    .0210732
had_p~d_vacc |   .0376677   .0324857     1.16   0.246    -.0260295    .1013649
had_p~u_vacc |  -.0234316   .0356527    -0.66   0.511    -.0933385    .0464753
             |
covid_vacc~n |
1. None/d..  |   -.021851   .0327122    -0.67   0.504    -.0859923    .0422903
2. Mild ..)  |  -.0327525   .0317581    -1.03   0.302     -.095023     .029518
  3. Severe  |          0  (omitted)
             |
flu_vacc_r~n |
1. None/d..  |   .0152978   .0373246     0.41   0.682    -.0578874     .088483
2. Mild ..)  |   .0339034    .037818     0.90   0.370    -.0402492    .1080559
  3. Severe  |          0  (omitted)
             |
         age |
   3. 35-49  |  -.0853809    .020104    -4.25   0.000    -.1248002   -.0459616
   4. 50-64  |   -.126476   .0233523    -5.42   0.000    -.1722645   -.0806875
   5. 65-74  |  -.1789919   .0377931    -4.74   0.000    -.2530956   -.1048881
     6. 75+  |  -.0209916   .2039344    -0.10   0.918    -.4208609    .3788776
             |
      gender |
  2. Female  |  -.0107897   .0167546    -0.64   0.520    -.0436416    .0220622
   3. Other  |    .172851   .1038551     1.66   0.096    -.0307855    .3764874
4. Prefer..  |   .0302186   .2064992     0.15   0.884    -.3746798     .435117
             |
   education |
      2. HS  |   .0247434   .1078225     0.23   0.819    -.1866722    .2361591
3. Some c..  |  -.0096563   .1068912    -0.09   0.928    -.2192459    .1999333
4. 4-year..  |   .0036915   .1073456     0.03   0.973     -.206789    .2141719
5. More t..  |   .0085161   .1091448     0.08   0.938    -.2054923    .2225245
6. Prefer..  |   .0740631   .2002196     0.37   0.711    -.3185223    .4666485
             |
      income |
 2. $25-50k  |   .0300495   .0259923     1.16   0.248    -.0209155    .0810144
 3. $50-75k  |   .0217013   .0263756     0.82   0.411    -.0300154     .073418
4. $75-100k  |   .0530729   .0291654     1.82   0.069    -.0041138    .1102596
  5. >$100k  |   .0717562   .0279263     2.57   0.010      .016999    .1265134
6. Prefer..  |   .0011919   .0546421     0.02   0.983     -.105949    .1083329
             |
        race |
   2. Black  |   .0302827   .0251966     1.20   0.230    -.0191221    .0796875
   3. Asian  |   .1567885   .1063552     1.47   0.141    -.0517499     .365327
4. Am Ind..  |  -.0319293    .033295    -0.96   0.338    -.0972133    .0333548
5. Pacifi..  |   -.006295   .2226189    -0.03   0.977    -.4428005    .4302105
   6. Other  |   .0479202   .0472462     1.01   0.311     -.044719    .1405594
7. Prefer..  |  -.1613767   .0817687    -1.97   0.049    -.3217067   -.0010468
             |
   ethnicity |
      2. No  |   .0196945   .0305269     0.65   0.519    -.0401619    .0795508
3. Prefer..  |    .035183   .1198052     0.29   0.769    -.1997279    .2700938
             |
    polviews |
 2. Liberal  |    .033491    .031493     1.06   0.288    -.0282597    .0952416
3. Slight..  |   .0443074   .0341887     1.30   0.195    -.0227289    .1113437
4. Moderate  |   .0680333    .031309     2.17   0.030     .0066435    .1294231
5. Slight..  |   .0228917   .0350996     0.65   0.514    -.0459307    .0917142
6. Conser..  |   .0757537   .0329632     2.30   0.022     .0111203    .1403871
7. Very c..  |    .082311   .0420229     1.96   0.050    -.0000865    .1647085
8. Prefer..  |  -.0517812   .0676502    -0.77   0.444     -.184428    .0808656
             |
  trust_govt |
2. Somewh..  |  -.0127364   .0305264    -0.42   0.677    -.0725917     .047119
3. Neithe..  |   -.037619   .0289025    -1.30   0.193    -.0942902    .0190523
4. Somewh..  |  -.0289221   .0291292    -0.99   0.321    -.0860378    .0281936
5. Strong..  |  -.0245381   .0357539    -0.69   0.493    -.0946434    .0455673
             |
 cond_asthma |  -.0576122   .0495502    -1.16   0.245     -.154769    .0395447
   cond_lung |   .0011974   .0818441     0.01   0.988    -.1592804    .1616752
  cond_heart |  -.0001719   .0568481    -0.00   0.998    -.1116383    .1112945
cond_diabe~s |  -.0669464   .0488648    -1.37   0.171    -.1627593    .0288664
 cond_kidney |  -.1234413   .0592916    -2.08   0.037    -.2396987   -.0071839
cond_rathe~y |  -.1225796   .1178248    -1.04   0.298    -.3536074    .1084482
   cond_none |  -.0913883   .0508869    -1.80   0.073    -.1911659    .0083894
       _cons |   .3029581   .1333458     2.27   0.023     .0414971     .564419
------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
yes_recall~y |        742    .2466307    .4313407          0          1

added scalar:
                 e(cm) =  .24663073
note: 3.covid_vacc_reaction omitted because of collinearity.
note: 3.flu_vacc_reaction omitted because of collinearity.

Linear regression                               Number of obs     =      2,515
                                                F(65, 2449)       =       3.69
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0604
                                                Root MSE          =     .47778

------------------------------------------------------------------------------
             |               Robust
yes_recall~u | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
arm_industry |   .0433749    .027285     1.59   0.112    -.0101291    .0968789
arm_academic |    .072058   .0275137     2.62   0.009     .0181055    .1260105
arm_personal |   .0483687   .0273164     1.77   0.077    -.0051969    .1019342
             |
prior_self~o |
2. Very u..  |  -.0137176     .02738    -0.50   0.616     -.067408    .0399728
3. Somewh..  |   -.015693   .0345651    -0.45   0.650    -.0834729    .0520869
4. Neithe..  |  -.0295898   .0444598    -0.67   0.506    -.1167724    .0575928
5. Somewh..  |   .0121386   .0369931     0.33   0.743    -.0604025    .0846797
6. Very l..  |  -.1250435    .046732    -2.68   0.008    -.2166819    -.033405
7. Would ..  |  -.1087141   .0776824    -1.40   0.162    -.2610442     .043616
             |
prior_self~c |
2. Very u..  |   -.033013    .067327    -0.49   0.624    -.1650368    .0990107
3. Somewh..  |   .0157804   .0671815     0.23   0.814    -.1159581    .1475188
4. Neithe..  |  -.0172746   .0704338    -0.25   0.806    -.1553905    .1208413
5. Somewh..  |    .029029   .0650709     0.45   0.656    -.0985707    .1566286
6. Very l..  |   .0256093   .0677877     0.38   0.706    -.1073178    .1585364
7. Would ..  |  -.0116674    .075654    -0.15   0.877    -.1600199    .1366852
             |
pre_vacc_i~e |
2. May or..  |   .0384013   .0238307     1.61   0.107    -.0083291    .0851317
had_p~d_vacc |   .0271572   .0373779     0.73   0.468    -.0461383    .1004528
had_p~u_vacc |  -.0002817   .0433597    -0.01   0.995    -.0853073    .0847438
             |
covid_vacc~n |
1. None/d..  |  -.0623019   .0381376    -1.63   0.102    -.1370872    .0124834
2. Mild ..)  |  -.0186295    .037408    -0.50   0.619    -.0919842    .0547251
  3. Severe  |          0  (omitted)
             |
flu_vacc_r~n |
1. None/d..  |  -.0117229   .0460689    -0.25   0.799    -.1020609    .0786152
2. Mild ..)  |   .0404517   .0463227     0.87   0.383    -.0503841    .1312875
  3. Severe  |          0  (omitted)
             |
         age |
   3. 35-49  |  -.0679359   .0238316    -2.85   0.004     -.114668   -.0212037
   4. 50-64  |  -.1020763    .028133    -3.63   0.000    -.1572432   -.0469094
   5. 65-74  |  -.1145361   .0489784    -2.34   0.019    -.2105795   -.0184927
     6. 75+  |  -.3208396   .2228231    -1.44   0.150    -.7577809    .1161017
             |
      gender |
  2. Female  |   .0211833   .0207074     1.02   0.306    -.0194225     .061789
   3. Other  |  -.0379723   .1070083    -0.35   0.723    -.2478084    .1718639
4. Prefer..  |  -.0617564   .2391362    -0.26   0.796    -.5306865    .4071737
             |
   education |
      2. HS  |  -.0238312   .1532279    -0.16   0.876    -.3243008    .2766385
3. Some c..  |  -.0994556   .1521101    -0.65   0.513    -.3977334    .1988222
4. 4-year..  |  -.0951646   .1522541    -0.63   0.532    -.3937247    .2033956
5. More t..  |  -.0754378   .1538092    -0.49   0.624    -.3770474    .2261718
6. Prefer..  |   .2981917    .233418     1.28   0.202    -.1595254    .7559088
             |
      income |
 2. $25-50k  |   .0222344   .0324678     0.68   0.494    -.0414328    .0859017
 3. $50-75k  |   .0651033   .0336084     1.94   0.053    -.0008005    .1310072
4. $75-100k  |   .0518875   .0362274     1.43   0.152     -.019152     .122927
  5. >$100k  |   .0544302   .0355443     1.53   0.126    -.0152698    .1241302
6. Prefer..  |  -.0847749   .0600066    -1.41   0.158    -.2024438    .0328939
             |
        race |
   2. Black  |   .0588186   .0312406     1.88   0.060    -.0024421    .1200794
   3. Asian  |   .1618912   .1051378     1.54   0.124    -.0442769    .3680594
4. Am Ind..  |  -.0715114   .0413163    -1.73   0.084    -.1525299    .0095071
5. Pacifi..  |   .3929537   .1712624     2.29   0.022     .0571196    .7287879
   6. Other  |   .0120857   .0544604     0.22   0.824    -.0947074    .1188789
7. Prefer..  |  -.0863729   .0855754    -1.01   0.313    -.2541804    .0814347
             |
   ethnicity |
      2. No  |  -.0047886   .0366755    -0.13   0.896    -.0767069    .0671296
3. Prefer..  |     .04062   .1402763     0.29   0.772    -.2344524    .3156924
             |
    polviews |
 2. Liberal  |   .0258295   .0392443     0.66   0.510    -.0511261     .102785
3. Slight..  |   .0372683   .0427481     0.87   0.383    -.0465578    .1210945
4. Moderate  |  -.0152859   .0381845    -0.40   0.689    -.0901631    .0595913
5. Slight..  |  -.0472309   .0439437    -1.07   0.283    -.1334016    .0389398
6. Conser..  |   .0300282   .0409493     0.73   0.463    -.0502707     .110327
7. Very c..  |   .0016108   .0503026     0.03   0.974    -.0970292    .1002508
8. Prefer..  |  -.1855406   .0766792    -2.42   0.016    -.3359034   -.0351778
             |
  trust_govt |
2. Somewh..  |   .1113586    .035632     3.13   0.002     .0414866    .1812306
3. Neithe..  |   .0532301   .0335507     1.59   0.113    -.0125605    .1190208
4. Somewh..  |    .132035   .0344673     3.83   0.000      .064447    .1996231
5. Strong..  |   .1122901   .0431979     2.60   0.009      .027582    .1969982
             |
 cond_asthma |  -.0980268   .0624701    -1.57   0.117    -.2205265     .024473
   cond_lung |  -.1631797   .0919327    -1.77   0.076    -.3434536    .0170941
  cond_heart |   .0695313   .0734837     0.95   0.344    -.0745653     .213628
cond_diabe~s |  -.1482291   .0616156    -2.41   0.016    -.2690533    -.027405
 cond_kidney |  -.1821967   .0756226    -2.41   0.016    -.3304875   -.0339059
cond_rathe~y |  -.1317225   .1379048    -0.96   0.340    -.4021446    .1386996
   cond_none |  -.1448563   .0634382    -2.28   0.022    -.2692543   -.0204582
       _cons |   .4704807   .1843334     2.55   0.011     .1090154    .8319461
------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
yes_recall~u |        631    .3486529    .4769219          0          1

added scalar:
                 e(cm) =  .34865293
note: 3.covid_vacc_reaction omitted because of collinearity.
note: 3.flu_vacc_reaction omitted because of collinearity.

Linear regression                               Number of obs     =      2,515
                                                F(65, 2449)       =       4.73
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0674
                                                Root MSE          =     .48927

------------------------------------------------------------------------------
             |               Robust
yes_recal~ni | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
arm_industry |   .0234167   .0280126     0.84   0.403     -.031514    .0783475
arm_academic |   .0721728   .0281724     2.56   0.010     .0169286    .1274169
arm_personal |   .0501823   .0280765     1.79   0.074    -.0048738    .1052384
             |
prior_self~o |
2. Very u..  |  -.0426393   .0278417    -1.53   0.126     -.097235    .0119564
3. Somewh..  |  -.0112772   .0352028    -0.32   0.749    -.0803076    .0577532
4. Neithe..  |   .0287935   .0464211     0.62   0.535    -.0622353    .1198223
5. Somewh..  |   -.013747   .0373379    -0.37   0.713    -.0869641    .0594702
6. Very l..  |  -.1347285   .0509672    -2.64   0.008    -.2346718   -.0347853
7. Would ..  |   .0095248   .0858677     0.11   0.912    -.1588561    .1779056
             |
prior_self~c |
2. Very u..  |  -.0270403   .0701866    -0.39   0.700    -.1646715    .1105909
3. Somewh..  |   .0290414   .0697208     0.42   0.677    -.1076764    .1657593
4. Neithe..  |   -.080818    .073133    -1.11   0.269     -.224227     .062591
5. Somewh..  |   .0247081   .0676577     0.37   0.715    -.1079641    .1573802
6. Very l..  |   .0559839   .0703749     0.80   0.426    -.0820165    .1939843
7. Would ..  |  -.0475197    .079411    -0.60   0.550    -.2032394    .1082001
             |
pre_vacc_i~e |
2. May or..  |   .0475275   .0243118     1.95   0.051    -.0001462    .0952012
had_p~d_vacc |   .0106797   .0375907     0.28   0.776    -.0630332    .0843926
had_p~u_vacc |   .0649378    .045047     1.44   0.150    -.0233964    .1532719
             |
covid_vacc~n |
1. None/d..  |  -.0428013   .0388741    -1.10   0.271    -.1190307    .0334281
2. Mild ..)  |  -.0033346   .0372779    -0.09   0.929     -.076434    .0697648
  3. Severe  |          0  (omitted)
             |
flu_vacc_r~n |
1. None/d..  |  -.0461853    .047689    -0.97   0.333    -.1397003    .0473296
2. Mild ..)  |  -.0220279   .0474657    -0.46   0.643     -.115105    .0710493
  3. Severe  |          0  (omitted)
             |
         age |
   3. 35-49  |  -.0852915   .0239813    -3.56   0.000    -.1323172   -.0382657
   4. 50-64  |  -.1500393   .0286673    -5.23   0.000    -.2062539   -.0938247
   5. 65-74  |  -.1219135   .0514629    -2.37   0.018    -.2228289   -.0209981
     6. 75+  |  -.3541215   .2219687    -1.60   0.111    -.7893872    .0811442
             |
      gender |
  2. Female  |   .0496529   .0210116     2.36   0.018     .0084506    .0908552
   3. Other  |   .0258569   .1061932     0.24   0.808    -.1823809    .2340947
4. Prefer..  |   .0361287   .2466928     0.15   0.884    -.4476193    .5198768
             |
   education |
      2. HS  |  -.0348798   .1540498    -0.23   0.821    -.3369612    .2672017
3. Some c..  |   -.070422   .1530048    -0.46   0.645    -.3704542    .2296103
4. 4-year..  |  -.0785774   .1532854    -0.51   0.608    -.3791597    .2220049
5. More t..  |  -.1084201   .1549721    -0.70   0.484    -.4123101    .1954698
6. Prefer..  |   .4486794   .1643993     2.73   0.006     .1263033    .7710555
             |
      income |
 2. $25-50k  |   .0157493   .0333924     0.47   0.637    -.0497309    .0812295
 3. $50-75k  |   .0840189   .0346673     2.42   0.015     .0160386    .1519993
4. $75-100k  |   .0719914   .0372902     1.93   0.054    -.0011321     .145115
  5. >$100k  |   .1037751   .0363251     2.86   0.004      .032544    .1750062
6. Prefer..  |   .0079373   .0692949     0.11   0.909    -.1279454      .14382
             |
        race |
   2. Black  |   .0864679   .0313667     2.76   0.006     .0249599    .1479758
   3. Asian  |   .2002012   .0975131     2.05   0.040     .0089845    .3914178
4. Am Ind..  |  -.0204269   .0440202    -0.46   0.643    -.1067477    .0658938
5. Pacifi..  |   .2905887   .1579387     1.84   0.066    -.0191185    .6002959
   6. Other  |   .0239682   .0549135     0.44   0.663    -.0837134    .1316498
7. Prefer..  |   -.084906   .1133132    -0.75   0.454    -.3071056    .1372935
             |
   ethnicity |
      2. No  |  -.0040204   .0372425    -0.11   0.914    -.0770505    .0690097
3. Prefer..  |  -.3084632    .107123    -2.88   0.004    -.5185244   -.0984021
             |
    polviews |
 2. Liberal  |   .0456457    .039347     1.16   0.246    -.0315111    .1228024
3. Slight..  |  -.0124731   .0433507    -0.29   0.774     -.097481    .0725348
4. Moderate  |   .0085099   .0384305     0.22   0.825    -.0668498    .0838696
5. Slight..  |   .0483831   .0444948     1.09   0.277    -.0388682    .1356343
6. Conser..  |   .0577682   .0413573     1.40   0.163    -.0233307     .138867
7. Very c..  |   .0191272   .0525026     0.36   0.716    -.0838268    .1220812
8. Prefer..  |  -.2174391   .0865963    -2.51   0.012    -.3872488   -.0476295
             |
  trust_govt |
2. Somewh..  |   .0955149   .0375288     2.55   0.011     .0219233    .1691064
3. Neithe..  |   .0147898   .0361424     0.41   0.682    -.0560829    .0856626
4. Somewh..  |   .0522297   .0366538     1.42   0.154    -.0196459    .1241054
5. Strong..  |    .086342   .0452235     1.91   0.056    -.0023383    .1750223
             |
 cond_asthma |  -.0726211   .0646304    -1.12   0.261     -.199357    .0541148
   cond_lung |  -.1838835   .0985459    -1.87   0.062    -.3771255    .0093585
  cond_heart |   .0154967   .0746087     0.21   0.835     -.130806    .1617994
cond_diabe~s |   -.113091   .0636928    -1.78   0.076    -.2379883    .0118064
 cond_kidney |   -.099281   .0920562    -1.08   0.281    -.2797971    .0812351
cond_rathe~y |   -.255649   .1327006    -1.93   0.054     -.515866    .0045681
   cond_none |  -.0839692   .0663545    -1.27   0.206     -.214086    .0461475
       _cons |   .5286068   .1871224     2.82   0.005     .1616724    .8955412
------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
yes_recal~ni |        631    .4801902    .5000038          0          1

added scalar:
                 e(cm) =  .48019017
note: 3.covid_vacc_reaction omitted because of collinearity.
note: 3.flu_vacc_reaction omitted because of collinearity.

Linear regression                               Number of obs     =      2,515
                                                F(65, 2449)       =       2.34
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0355
                                                Root MSE          =     .30909

------------------------------------------------------------------------------
             |               Robust
yes_recal~vi | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
arm_industry |  -.0131795   .0176289    -0.75   0.455    -.0477485    .0213896
arm_academic |   .0025538   .0182916     0.14   0.889    -.0333148    .0384224
arm_personal |  -.0016969   .0175269    -0.10   0.923    -.0360659    .0326722
             |
prior_self~o |
2. Very u..  |  -.0244669   .0183652    -1.33   0.183    -.0604798     .011546
3. Somewh..  |   -.029495   .0225191    -1.31   0.190    -.0736534    .0146634
4. Neithe..  |   .0092597   .0317085     0.29   0.770    -.0529186    .0714379
5. Somewh..  |   .0028205    .025491     0.11   0.912    -.0471656    .0528065
6. Very l..  |   -.053172   .0297948    -1.78   0.074    -.1115977    .0052537
7. Would ..  |    .034965   .0613693     0.57   0.569    -.0853761     .155306
             |
prior_self~c |
2. Very u..  |  -.1001212   .0537995    -1.86   0.063    -.2056184    .0053759
3. Somewh..  |  -.0833238   .0541804    -1.54   0.124     -.189568    .0229204
4. Neithe..  |   -.091901   .0564452    -1.63   0.104    -.2025863    .0187844
5. Somewh..  |  -.1038236   .0529651    -1.96   0.050    -.2076847    .0000374
6. Very l..  |   -.082323   .0551864    -1.49   0.136    -.1905398    .0258938
7. Would ..  |  -.1083425   .0608395    -1.78   0.075    -.2276447    .0109596
             |
pre_vacc_i~e |
2. May or..  |    .035414   .0148416     2.39   0.017     .0063106    .0645174
had_p~d_vacc |  -.0478734   .0236445    -2.02   0.043    -.0942388   -.0015081
had_p~u_vacc |  -.0248003   .0282658    -0.88   0.380    -.0802276     .030627
             |
covid_vacc~n |
1. None/d..  |   .0269712   .0234266     1.15   0.250    -.0189668    .0729093
2. Mild ..)  |   .0084428   .0220447     0.38   0.702    -.0347853     .051671
  3. Severe  |          0  (omitted)
             |
flu_vacc_r~n |
1. None/d..  |  -.0237366   .0295438    -0.80   0.422    -.0816701    .0341969
2. Mild ..)  |   .0217492    .029145     0.75   0.456    -.0354022    .0789006
  3. Severe  |          0  (omitted)
             |
         age |
   3. 35-49  |  -.0178937   .0147534    -1.21   0.225    -.0468241    .0110367
   4. 50-64  |   .0147603   .0190708     0.77   0.439    -.0226362    .0521568
   5. 65-74  |   .0142098   .0353513     0.40   0.688    -.0551116    .0835313
     6. 75+  |  -.2256195   .2152354    -1.05   0.295    -.6476819    .1964428
             |
      gender |
  2. Female  |   .0129923   .0133933     0.97   0.332    -.0132711    .0392557
   3. Other  |  -.0210623   .0496345    -0.42   0.671    -.1183923    .0762676
4. Prefer..  |   .2169634     .22445     0.97   0.334    -.2231679    .6570948
             |
   education |
      2. HS  |   .0345278   .0895525     0.39   0.700    -.1410786    .2101343
3. Some c..  |   .0209104   .0888046     0.24   0.814    -.1532294    .1950502
4. 4-year..  |   .0313981   .0891221     0.35   0.725    -.1433645    .2061607
5. More t..  |   .0469861     .09005     0.52   0.602    -.1295958    .2235681
6. Prefer..  |   .2319674   .1989282     1.17   0.244    -.1581175    .6220524
             |
      income |
 2. $25-50k  |   .0206183   .0208378     0.99   0.323    -.0202432    .0614798
 3. $50-75k  |   .0342056   .0215295     1.59   0.112    -.0080123    .0764235
4. $75-100k  |   .0131425   .0223151     0.59   0.556    -.0306158    .0569009
  5. >$100k  |    .033208   .0231051     1.44   0.151    -.0120996    .0785157
6. Prefer..  |  -.0021908   .0382176    -0.06   0.954     -.077133    .0727513
             |
        race |
   2. Black  |   .0251947   .0217379     1.16   0.247    -.0174319    .0678212
   3. Asian  |   .0224708   .0748121     0.30   0.764    -.1242308    .1691724
4. Am Ind..  |  -.0277531   .0243364    -1.14   0.254    -.0754752     .019969
5. Pacifi..  |  -.1385926   .0318931    -4.35   0.000    -.2011328   -.0760523
   6. Other  |  -.0351413   .0325808    -1.08   0.281      -.09903    .0287475
7. Prefer..  |   -.105431   .0432605    -2.44   0.015    -.1902619   -.0206001
             |
   ethnicity |
      2. No  |  -.0187076   .0247643    -0.76   0.450    -.0672688    .0298537
3. Prefer..  |  -.0167615   .0459785    -0.36   0.715    -.1069222    .0733992
             |
    polviews |
 2. Liberal  |   .0398316   .0227266     1.75   0.080    -.0047339     .084397
3. Slight..  |   .0024577    .022959     0.11   0.915    -.0425634    .0474788
4. Moderate  |   .0519036   .0228123     2.28   0.023     .0071703    .0966369
5. Slight..  |   .0341658   .0271514     1.26   0.208    -.0190764     .087408
6. Conser..  |   .0282601   .0241428     1.17   0.242    -.0190824    .0756025
7. Very c..  |   .0462815   .0342058     1.35   0.176    -.0207937    .1133567
8. Prefer..  |  -.0499528   .0255687    -1.95   0.051    -.1000914    .0001858
             |
  trust_govt |
2. Somewh..  |   .0206796   .0238336     0.87   0.386    -.0260566    .0674157
3. Neithe..  |   .0087201   .0221956     0.39   0.694     -.034804    .0522441
4. Somewh..  |   .0367031   .0224194     1.64   0.102    -.0072598     .080666
5. Strong..  |  -.0043621   .0259941    -0.17   0.867    -.0553348    .0466105
             |
 cond_asthma |  -.0480926   .0399428    -1.20   0.229    -.1264178    .0302327
   cond_lung |  -.0719204   .0550375    -1.31   0.191    -.1798453    .0360045
  cond_heart |   .0567664   .0544664     1.04   0.297    -.0500384    .1635713
cond_diabe~s |  -.0029967   .0393172    -0.08   0.939     -.080095    .0741017
 cond_kidney |   .0005776   .0679624     0.01   0.993    -.1326921    .1338474
cond_rathe~y |  -.1496686   .0483305    -3.10   0.002    -.2444415   -.0548956
   cond_none |  -.0341405   .0430214    -0.79   0.428    -.1185026    .0502216
       _cons |   .1901329   .1137228     1.67   0.095      -.03287    .4131358
------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
yes_recal~vi |        631    .1093502    .3123257          0          1

added scalar:
                 e(cm) =  .10935024

. 
. local coltitles mtitles("Recall Study" "Recall Manu" "Recall Uni" "Recall GAV
> I")

. 
. esttab m_yes_recall_study m_yes_recall_manu m_yes_recall_uni m_yes_recall_gav
> i ///
>     using output/tables/persistence_recall.tex, ///
>     b(%9.3f) se(%9.3f) keep(`keyvars') label nostar ///
>     stats(cm N, labels("Control mean" "N") fmt(%9.3f %9.0fc)) ///
>     fragment replace nomtitles nonotes nonumbers nolines nogaps
(output written to output/tables/persistence_recall.tex)

. 
. esttab m_yes_recall_study m_yes_recall_manu m_yes_recall_uni m_yes_recall_gav
> i ///
>     using output/tables/persistence_recall.md, ///
>     b(%9.3f) se(%9.3f) keep(`keyvars') label nostar `coltitles' ///
>     stats(cm N, labels("Control mean" "N") fmt(%9.3f %9.0fc)) ///
>     fragment replace nonotes nonumbers
(output written to output/tables/persistence_recall.md)

. 
. /*---------------------------------------------------------------------------
> ---
>     5. Adverse event rates table
> -----------------------------------------------------------------------------
> -*/
. 
. eststo clear

. 
. foreach y in guess_placebo placebo_correct guess_vaccine vaccine_correct gues
> s_delta {
  2.     regress `y' `keyvars' $controls if se_sample, robust
  3.     sum `y' if arm_control==1 & se_sample
  4.     estadd scalar cm = r(mean)
  5.     eststo m_`y'
  6. }
note: 3.covid_vacc_reaction omitted because of collinearity.
note: 3.flu_vacc_reaction omitted because of collinearity.

Linear regression                               Number of obs     =      2,988
                                                F(65, 2922)       =       4.27
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0867
                                                Root MSE          =     16.489

------------------------------------------------------------------------------
             |               Robust
guess_plac~o | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
arm_industry |  -.0518714   .8478151    -0.06   0.951    -1.714247    1.610504
arm_academic |   .7947602   .8728884     0.91   0.363    -.9167785    2.506299
arm_personal |   1.018531   .8639337     1.18   0.239    -.6754499    2.712511
             |
prior_self~o |
2. Very u..  |  -1.534283   .8278465    -1.85   0.064    -3.157505    .0889385
3. Somewh..  |   2.070472   1.121622     1.85   0.065    -.1287771    4.269721
4. Neithe..  |   2.670036   1.535401     1.74   0.082     -.340542    5.680614
5. Somewh..  |   3.833242   1.198702     3.20   0.001     1.482857    6.183628
6. Very l..  |   .3946784   1.573927     0.25   0.802    -2.691441    3.480797
7. Would ..  |   2.185338   3.081606     0.71   0.478    -3.857002    8.227679
             |
prior_self~c |
2. Very u..  |   -6.27018   2.540178    -2.47   0.014     -11.2509   -1.289459
3. Somewh..  |  -6.746391    2.54243    -2.65   0.008    -11.73153   -1.761255
4. Neithe..  |  -4.059862   2.664962    -1.52   0.128    -9.285256    1.165531
5. Somewh..  |  -5.059279   2.478684    -2.04   0.041    -9.919424   -.1991339
6. Very l..  |  -3.304634   2.561293    -1.29   0.197    -8.326756    1.717488
7. Would ..  |  -1.040754   2.909829    -0.36   0.721    -6.746278     4.66477
             |
pre_vacc_i~e |
2. May or..  |  -.1330348   .7474163    -0.18   0.859    -1.598551    1.332481
had_p~d_vacc |  -.2873541     1.2235    -0.23   0.814    -2.686364    2.111655
had_p~u_vacc |  -.7519432   1.426631    -0.53   0.598    -3.549246     2.04536
             |
covid_vacc~n |
1. None/d..  |   1.529288   1.200174     1.27   0.203    -.8239841    3.882561
2. Mild ..)  |   2.339509   1.184642     1.97   0.048     .0166911    4.662327
  3. Severe  |          0  (omitted)
             |
flu_vacc_r~n |
1. None/d..  |  -1.107293   1.492282    -0.74   0.458    -4.033324    1.818739
2. Mild ..)  |   2.098859    1.50055     1.40   0.162    -.8433835    5.041101
  3. Severe  |          0  (omitted)
             |
         age |
   3. 35-49  |  -3.142454   .7459205    -4.21   0.000    -4.605037   -1.679871
   4. 50-64  |  -4.961532     .88483    -5.61   0.000    -6.696486   -3.226578
   5. 65-74  |  -5.374261   1.493698    -3.60   0.000    -8.303069   -2.445453
     6. 75+  |  -9.559171   10.42843    -0.92   0.359    -30.00699    10.88864
             |
      gender |
  2. Female  |   1.164293   .6513279     1.79   0.074     -.112815    2.441401
   3. Other  |  -1.525743   3.164103    -0.48   0.630    -7.729841    4.678355
4. Prefer..  |   2.177868   8.081843     0.27   0.788    -13.66882    18.02455
             |
   education |
      2. HS  |   1.769701   5.253823     0.34   0.736     -8.53187    12.07127
3. Some c..  |  -.1991541    5.22742    -0.04   0.970    -10.44895    10.05065
4. 4-year..  |  -1.021114   5.245206    -0.19   0.846    -11.30579     9.26356
5. More t..  |  -1.441399   5.287175    -0.27   0.785    -11.80837    8.925568
6. Prefer..  |   2.589869   8.870338     0.29   0.770    -14.80288    19.98262
             |
      income |
 2. $25-50k  |   1.631763   1.066391     1.53   0.126    -.4591916    3.722718
 3. $50-75k  |   .5867092   1.068262     0.55   0.583    -1.507914    2.681332
4. $75-100k  |   1.254078   1.159189     1.08   0.279    -1.018832    3.526988
  5. >$100k  |   .9050843   1.099822     0.82   0.411     -1.25142    3.061588
6. Prefer..  |   1.757122   2.534896     0.69   0.488    -3.213242    6.727486
             |
        race |
   2. Black  |   4.390509   1.011541     4.34   0.000     2.407104    6.373914
   3. Asian  |  -4.505673   2.332788    -1.93   0.054    -9.079749    .0684027
4. Am Ind..  |   3.503054   1.324013     2.65   0.008     .9069603    6.099147
5. Pacifi..  |   -6.40814   4.544696    -1.41   0.159    -15.31927    2.502992
   6. Other  |   1.252783   1.693251     0.74   0.459    -2.067303    4.572869
7. Prefer..  |   -5.76096   4.368081    -1.32   0.187    -14.32579    2.803869
             |
   ethnicity |
      2. No  |  -1.449046   1.126036    -1.29   0.198    -3.656951    .7588586
3. Prefer..  |   2.242486   4.321476     0.52   0.604    -6.230961    10.71593
             |
    polviews |
 2. Liberal  |  -.6202984   1.252221    -0.50   0.620    -3.075624    1.835027
3. Slight..  |  -.0335645   1.349771    -0.02   0.980    -2.680163    2.613034
4. Moderate  |    2.21265   1.269195     1.74   0.081    -.2759584    4.701258
5. Slight..  |    .483057   1.436483     0.34   0.737    -2.333565    3.299679
6. Conser..  |   2.516101   1.380579     1.82   0.068    -.1909054    5.223108
7. Very c..  |   2.939428   1.713323     1.72   0.086    -.4200161    6.298871
8. Prefer..  |   4.501258     3.2422     1.39   0.165     -1.85597    10.85849
             |
  trust_govt |
2. Somewh..  |   1.258642    1.20598     1.04   0.297    -1.106014    3.623299
3. Neithe..  |  -.8013309   1.089387    -0.74   0.462    -2.937376    1.334714
4. Somewh..  |  -.9870816   1.088906    -0.91   0.365    -3.122183     1.14802
5. Strong..  |  -2.250991    1.33772    -1.68   0.093    -4.873961    .3719791
             |
 cond_asthma |  -1.510275   2.739971    -0.55   0.582    -6.882745    3.862194
   cond_lung |   1.272901   4.521844     0.28   0.778    -7.593422    10.13922
  cond_heart |   4.670401   3.169079     1.47   0.141    -1.543453    10.88426
cond_diabe~s |  -3.286284   2.258796    -1.45   0.146    -7.715277    1.142708
 cond_kidney |    4.87148   4.033851     1.21   0.227    -3.037999    12.78096
cond_rathe~y |  -6.083234   4.394742    -1.38   0.166    -14.70034    2.533871
   cond_none |   -2.58661   2.814672    -0.92   0.358    -8.105551    2.932331
       _cons |    23.3344   6.502441     3.59   0.000     10.58457    36.08423
------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
guess_plac~o |        739    15.54452    16.88422          0         87

added scalar:
                 e(cm) =  15.54452
note: 3.covid_vacc_reaction omitted because of collinearity.
note: 3.flu_vacc_reaction omitted because of collinearity.

Linear regression                               Number of obs     =      2,988
                                                F(65, 2922)       =       2.86
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0426
                                                Root MSE          =     .40732

------------------------------------------------------------------------------
             |               Robust
placebo_co~t | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
arm_industry |   .0008625   .0216727     0.04   0.968    -.0416328    .0433578
arm_academic |   .0049966   .0218789     0.23   0.819     -.037903    .0478962
arm_personal |  -.0201431   .0211552    -0.95   0.341    -.0616237    .0213375
             |
prior_self~o |
2. Very u..  |   .0360316   .0216071     1.67   0.096    -.0063351    .0783983
3. Somewh..  |  -.0244374   .0264613    -0.92   0.356     -.076322    .0274473
4. Neithe..  |  -.0476969   .0328857    -1.45   0.147    -.1121783    .0167845
5. Somewh..  |  -.0195375   .0267946    -0.73   0.466    -.0720757    .0330007
6. Very l..  |  -.0437475   .0326132    -1.34   0.180    -.1076947    .0201997
7. Would ..  |  -.0334731   .0512292    -0.65   0.514    -.1339221    .0669759
             |
prior_self~c |
2. Very u..  |   .0906865   .0476118     1.90   0.057    -.0026695    .1840425
3. Somewh..  |   .1092592   .0470728     2.32   0.020     .0169599    .2015585
4. Neithe..  |   .0285076   .0483652     0.59   0.556    -.0663258     .123341
5. Somewh..  |   .0863352   .0448214     1.93   0.054    -.0015496      .17422
6. Very l..  |   .0430554   .0458097     0.94   0.347    -.0467672     .132878
7. Would ..  |    .006137   .0505589     0.12   0.903    -.0929977    .1052717
             |
pre_vacc_i~e |
2. May or..  |   .0160763   .0181242     0.89   0.375    -.0194612    .0516137
had_p~d_vacc |  -.0323793   .0288747    -1.12   0.262    -.0889962    .0242376
had_p~u_vacc |   .0049869   .0355774     0.14   0.889    -.0647724    .0747461
             |
covid_vacc~n |
1. None/d..  |  -.0005258   .0303223    -0.02   0.986    -.0599809    .0589294
2. Mild ..)  |  -.0139867   .0289264    -0.48   0.629    -.0707048    .0427314
  3. Severe  |          0  (omitted)
             |
flu_vacc_r~n |
1. None/d..  |     .00933   .0380323     0.25   0.806    -.0652428    .0839028
2. Mild ..)  |  -.0426961   .0368329    -1.16   0.246    -.1149172    .0295251
  3. Severe  |          0  (omitted)
             |
         age |
   3. 35-49  |  -.0036587    .018252    -0.20   0.841    -.0394468    .0321293
   4. 50-64  |   .0186989   .0223683     0.84   0.403    -.0251604    .0625581
   5. 65-74  |  -.0209573   .0379761    -0.55   0.581      -.09542    .0535054
     6. 75+  |  -.0193307   .1693959    -0.11   0.909    -.3514781    .3128167
             |
      gender |
  2. Female  |  -.0220733   .0159795    -1.38   0.167    -.0534054    .0092589
   3. Other  |  -.1111177    .075622    -1.47   0.142    -.2593955    .0371601
4. Prefer..  |  -.0976974   .1174761    -0.83   0.406    -.3280418     .132647
             |
   education |
      2. HS  |  -.1481146   .1250358    -1.18   0.236    -.3932819    .0970527
3. Some c..  |  -.1092446   .1247111    -0.88   0.381    -.3537752    .1352859
4. 4-year..  |  -.1238344   .1249469    -0.99   0.322    -.3688273    .1211584
5. More t..  |  -.0885477   .1262846    -0.70   0.483    -.3361635     .159068
6. Prefer..  |   .0411307     .21152     0.19   0.846    -.3736127     .455874
             |
      income |
 2. $25-50k  |  -.0031665   .0258823    -0.12   0.903    -.0539159    .0475829
 3. $50-75k  |  -.0301426   .0263241    -1.15   0.252    -.0817582    .0214731
4. $75-100k  |  -.0294938    .028525    -1.03   0.301    -.0854249    .0264372
  5. >$100k  |  -.0060741   .0282191    -0.22   0.830    -.0614054    .0492572
6. Prefer..  |   -.050231   .0528347    -0.95   0.342    -.1538281    .0533661
             |
        race |
   2. Black  |  -.0627702   .0214676    -2.92   0.003    -.1048633   -.0206771
   3. Asian  |   .0415203   .0884785     0.47   0.639    -.1319662    .2150069
4. Am Ind..  |  -.0359408   .0301512    -1.19   0.233    -.0950606    .0231789
5. Pacifi..  |    .014548   .2126544     0.07   0.945    -.4024196    .4315157
   6. Other  |  -.0317559   .0415551    -0.76   0.445    -.1132363    .0497244
7. Prefer..  |   .1814182   .1087495     1.67   0.095    -.0318153    .3946516
             |
   ethnicity |
      2. No  |   .0107205   .0284812     0.38   0.707    -.0451248    .0665658
3. Prefer..  |   -.232788   .0935947    -2.49   0.013    -.4163062   -.0492698
             |
    polviews |
 2. Liberal  |  -.0391584   .0321566    -1.22   0.223    -.1022104    .0238936
3. Slight..  |  -.0153388   .0348531    -0.44   0.660     -.083678    .0530003
4. Moderate  |  -.0702859   .0306281    -2.29   0.022    -.1303408    -.010231
5. Slight..  |  -.0543904   .0358278    -1.52   0.129    -.1246407    .0158599
6. Conser..  |  -.0692026   .0325657    -2.13   0.034    -.1330566   -.0053486
7. Very c..  |  -.0775344   .0386606    -2.01   0.045     -.153339   -.0017297
8. Prefer..  |  -.1697747    .056238    -3.02   0.003    -.2800447   -.0595046
             |
  trust_govt |
2. Somewh..  |    .003597   .0275903     0.13   0.896    -.0505013    .0576953
3. Neithe..  |   .0178214   .0267944     0.67   0.506    -.0347164    .0703592
4. Somewh..  |  -.0032704   .0268895    -0.12   0.903    -.0559946    .0494538
5. Strong..  |   .0053643   .0342673     0.16   0.876    -.0618262    .0725547
             |
 cond_asthma |   .1205723   .0497502     2.42   0.015     .0230232    .2181214
   cond_lung |  -.0719162   .0491663    -1.46   0.144    -.1683202    .0244879
  cond_heart |   .0776929    .053101     1.46   0.144    -.0264262     .181812
cond_diabe~s |    .070659   .0495347     1.43   0.154    -.0264675    .1677855
 cond_kidney |   -.030062   .0551833    -0.54   0.586    -.1382642    .0781402
cond_rathe~y |   .1457582   .1251527     1.16   0.244    -.0996383    .3911547
   cond_none |   .1701756   .0497088     3.42   0.001     .0727078    .2676435
       _cons |   .2031187   .1481904     1.37   0.171    -.0874495     .493687
------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
placebo_co~t |        739    .2259811      .41851          0          1

added scalar:
                 e(cm) =  .22598106
note: 3.covid_vacc_reaction omitted because of collinearity.
note: 3.flu_vacc_reaction omitted because of collinearity.

Linear regression                               Number of obs     =      2,988
                                                F(65, 2922)       =       4.31
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0881
                                                Root MSE          =      16.34

------------------------------------------------------------------------------
             |               Robust
guess_vacc~e | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
arm_industry |  -2.697719   .8118109    -3.32   0.001    -4.289499    -1.10594
arm_academic |  -.7159781   .8803423    -0.81   0.416    -2.442132    1.010176
arm_personal |  -1.308322   .8602892    -1.52   0.128    -2.995157    .3785126
             |
prior_self~o |
2. Very u..  |  -.9257865    .874725    -1.06   0.290    -2.640926    .7893535
3. Somewh..  |  -.4655384    1.02505    -0.45   0.650    -2.475433    1.544356
4. Neithe..  |   1.788518   1.507919     1.19   0.236    -1.168173    4.745209
5. Somewh..  |   .7625515   1.182914     0.64   0.519    -1.556878    3.081981
6. Very l..  |   .5603749    1.84287     0.30   0.761     -3.05308     4.17383
7. Would ..  |   2.028625   3.840418     0.53   0.597    -5.501575    9.558826
             |
prior_self~c |
2. Very u..  |  -6.934786   2.399399    -2.89   0.004    -11.63947   -2.230101
3. Somewh..  |   -5.80263   2.410735    -2.41   0.016    -10.52954   -1.075719
4. Neithe..  |  -5.225355   2.507398    -2.08   0.037     -10.1418   -.3089088
5. Somewh..  |  -4.119008   2.394077    -1.72   0.085    -8.813257     .575241
6. Very l..  |   .3040425   2.500964     0.12   0.903    -4.599788    5.207874
7. Would ..  |   1.245754   2.941948     0.42   0.672    -4.522747    7.014256
             |
pre_vacc_i~e |
2. May or..  |  -.0159652   .6698438    -0.02   0.981    -1.329379    1.297449
had_p~d_vacc |   -1.26067   1.182909    -1.07   0.287    -3.580091     1.05875
had_p~u_vacc |  -.8271354    1.57878    -0.52   0.600    -3.922769    2.268499
             |
covid_vacc~n |
1. None/d..  |   .0700239   1.167407     0.06   0.952       -2.219    2.359048
2. Mild ..)  |   1.034559   1.193392     0.87   0.386    -1.305416    3.374534
  3. Severe  |          0  (omitted)
             |
flu_vacc_r~n |
1. None/d..  |   -.563171   1.579179    -0.36   0.721    -3.659588    2.533246
2. Mild ..)  |   1.716889   1.618955     1.06   0.289    -1.457519    4.891298
  3. Severe  |          0  (omitted)
             |
         age |
   3. 35-49  |  -1.134745    .745812    -1.52   0.128    -2.597116    .3276252
   4. 50-64  |  -1.727556   .8777172    -1.97   0.049    -3.448562   -.0065487
   5. 65-74  |  -1.854448    1.56315    -1.19   0.236    -4.919434    1.210538
     6. 75+  |  -1.563717   7.262208    -0.22   0.830    -15.80328    12.67585
             |
      gender |
  2. Female  |   1.732836   .6289706     2.76   0.006     .4995652    2.966106
   3. Other  |  -4.760192   1.608286    -2.96   0.003    -7.913681   -1.606704
4. Prefer..  |  -4.103696   5.465251    -0.75   0.453    -14.81983    6.612438
             |
   education |
      2. HS  |   .1827289    3.91098     0.05   0.963    -7.485827    7.851285
3. Some c..  |   .7625852   3.875689     0.20   0.844    -6.836774    8.361944
4. 4-year..  |  -.4705037   3.894903    -0.12   0.904    -8.107536    7.166529
5. More t..  |  -1.089479   3.967955    -0.27   0.784    -8.869752    6.690793
6. Prefer..  |   1.838335   8.500157     0.22   0.829    -14.82857    18.50524
             |
      income |
 2. $25-50k  |  -.4418249   1.110382    -0.40   0.691    -2.619035    1.735385
 3. $50-75k  |  -.4456797   1.149519    -0.39   0.698    -2.699629    1.808269
4. $75-100k  |  -1.026016   1.212645    -0.85   0.398    -3.403741    1.351709
  5. >$100k  |  -1.314868   1.135189    -1.16   0.247     -3.54072    .9109837
6. Prefer..  |   .3431848   2.395496     0.14   0.886    -4.353848    5.040217
             |
        race |
   2. Black  |   1.409406   1.000017     1.41   0.159    -.5514038    3.370215
   3. Asian  |  -5.371356   2.603583    -2.06   0.039     -10.4764   -.2663129
4. Am Ind..  |   2.044913   1.367528     1.50   0.135    -.6365036     4.72633
5. Pacifi..  |   1.177218   8.632607     0.14   0.892    -15.74939    18.10383
   6. Other  |   .5149707   1.917781     0.27   0.788    -3.245368    4.275309
7. Prefer..  |  -1.497952   3.238703    -0.46   0.644    -7.848324    4.852419
             |
   ethnicity |
      2. No  |  -.8161012   1.158231    -0.70   0.481    -3.087134    1.454931
3. Prefer..  |   1.144192   4.298968     0.27   0.790    -7.285121    9.573506
             |
    polviews |
 2. Liberal  |  -1.651315   1.198357    -1.38   0.168    -4.001024     .698394
3. Slight..  |  -.9469542   1.331617    -0.71   0.477    -3.557956    1.664048
4. Moderate  |   .0920413   1.248668     0.07   0.941    -2.356317    2.540399
5. Slight..  |   1.525386   1.451824     1.05   0.293    -1.321316    4.372089
6. Conser..  |    .652141   1.342851     0.49   0.627    -1.980889    3.285171
7. Very c..  |   -.475144   1.758744    -0.27   0.787    -3.923648     2.97336
8. Prefer..  |   1.751698   3.162523     0.55   0.580    -4.449302    7.952699
             |
  trust_govt |
2. Somewh..  |  -2.721791   1.361626    -2.00   0.046    -5.391636    -.051946
3. Neithe..  |  -4.793551   1.275703    -3.76   0.000    -7.294919   -2.292182
4. Somewh..  |  -3.895896   1.259089    -3.09   0.002    -6.364687   -1.427105
5. Strong..  |   -6.76007   1.426345    -4.74   0.000    -9.556814   -3.963327
             |
 cond_asthma |   .9251211   2.533247     0.37   0.715    -4.042009    5.892251
   cond_lung |   1.278321   3.250131     0.39   0.694    -5.094459      7.6511
  cond_heart |   1.531955    2.53683     0.60   0.546    -3.442201    6.506111
cond_diabe~s |   .2409652   2.498008     0.10   0.923     -4.65707       5.139
 cond_kidney |   6.986395    4.07121     1.72   0.086    -.9963371    14.96913
cond_rathe~y |   .3154877   8.220066     0.04   0.969    -15.80222     16.4332
   cond_none |   1.223591   2.574054     0.48   0.635    -3.823553    6.270734
       _cons |   23.84868   5.387395     4.43   0.000      13.2852    34.41215
------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
guess_vacc~e |        739    15.22124    16.76695          0         95

added scalar:
                 e(cm) =  15.221245
note: 3.covid_vacc_reaction omitted because of collinearity.
note: 3.flu_vacc_reaction omitted because of collinearity.

Linear regression                               Number of obs     =      2,988
                                                F(65, 2922)       =       3.14
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0302
                                                Root MSE          =     .32878

------------------------------------------------------------------------------
             |               Robust
vaccine_co~t | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
arm_industry |   .0023398   .0166792     0.14   0.888    -.0303644    .0350439
arm_academic |   .0023028   .0168135     0.14   0.891    -.0306647    .0352703
arm_personal |   .0345081   .0177034     1.95   0.051    -.0002043    .0692205
             |
prior_self~o |
2. Very u..  |  -.0140558   .0170652    -0.82   0.410    -.0475168    .0194052
3. Somewh..  |  -.0036277   .0213387    -0.17   0.865     -.045468    .0382127
4. Neithe..  |  -.0004221   .0304146    -0.01   0.989    -.0600583     .059214
5. Somewh..  |   .0229554   .0237221     0.97   0.333    -.0235584    .0694692
6. Very l..  |   .0009597   .0284962     0.03   0.973     -.054915    .0568344
7. Would ..  |  -.0216363    .040123    -0.54   0.590    -.1003086     .057036
             |
prior_self~c |
2. Very u..  |   .0313992   .0464024     0.68   0.499    -.0595855    .1223838
3. Somewh..  |  -.0293589   .0453205    -0.65   0.517    -.1182221    .0595044
4. Neithe..  |   -.008383   .0476886    -0.18   0.860    -.1018896    .0851236
5. Somewh..  |  -.0281788   .0440368    -0.64   0.522    -.1145252    .0581676
6. Very l..  |  -.0501658   .0451856    -1.11   0.267    -.1387646     .038433
7. Would ..  |  -.0734831   .0501808    -1.46   0.143    -.1718765    .0249103
             |
pre_vacc_i~e |
2. May or..  |   .0102356   .0149877     0.68   0.495    -.0191519    .0396232
had_p~d_vacc |  -.0415459   .0214413    -1.94   0.053    -.0835875    .0004956
had_p~u_vacc |   .0095607   .0270958     0.35   0.724    -.0435681    .0626896
             |
covid_vacc~n |
1. None/d..  |   .0472208   .0228633     2.07   0.039      .002391    .0920506
2. Mild ..)  |   .0229164   .0214563     1.07   0.286    -.0191545    .0649874
  3. Severe  |          0  (omitted)
             |
flu_vacc_r~n |
1. None/d..  |  -.0282869   .0292735    -0.97   0.334    -.0856856    .0291118
2. Mild ..)  |  -.0420283   .0286032    -1.47   0.142    -.0981128    .0140561
  3. Severe  |          0  (omitted)
             |
         age |
   3. 35-49  |  -.0023079   .0146399    -0.16   0.875    -.0310135    .0263977
   4. 50-64  |   .0029996   .0176472     0.17   0.865    -.0316027    .0376019
   5. 65-74  |   .0301114   .0348613     0.86   0.388    -.0382439    .0984666
     6. 75+  |  -.1932198   .1955096    -0.99   0.323    -.5765704    .1901308
             |
      gender |
  2. Female  |  -.0185493   .0128251    -1.45   0.148    -.0436964    .0065978
   3. Other  |  -.1397255   .0200866    -6.96   0.000    -.1791108   -.1003402
4. Prefer..  |   .1022983   .2112204     0.48   0.628    -.3118576    .5164542
             |
   education |
      2. HS  |   .0696427   .0719605     0.97   0.333    -.0714557    .2107412
3. Some c..  |   .0617636   .0714807     0.86   0.388    -.0783941    .2019213
4. 4-year..  |   .0748875   .0716304     1.05   0.296    -.0655637    .2153388
5. More t..  |   .0885461   .0729144     1.21   0.225    -.0544227     .231515
6. Prefer..  |   .2204705   .1822114     1.21   0.226    -.1368052    .5777463
             |
      income |
 2. $25-50k  |    .001487   .0213441     0.07   0.944    -.0403641    .0433381
 3. $50-75k  |  -.0314872   .0216359    -1.46   0.146    -.0739103    .0109359
4. $75-100k  |  -.0033275    .023524    -0.14   0.888    -.0494528    .0427977
  5. >$100k  |  -.0231337   .0225918    -1.02   0.306    -.0674312    .0211637
6. Prefer..  |  -.0543321   .0409919    -1.33   0.185     -.134708    .0260438
             |
        race |
   2. Black  |   .0095582   .0194751     0.49   0.624    -.0286282    .0477445
   3. Asian  |  -.0120739   .0597224    -0.20   0.840    -.1291761    .1050283
4. Am Ind..  |   .0227653   .0273439     0.83   0.405      -.03085    .0763806
5. Pacifi..  |   -.152402   .0276696    -5.51   0.000    -.2066558   -.0981482
   6. Other  |    .049358   .0385454     1.28   0.200    -.0262208    .1249369
7. Prefer..  |   .0330394   .0691414     0.48   0.633    -.1025314    .1686101
             |
   ethnicity |
      2. No  |   .0075468   .0240248     0.31   0.753    -.0395605    .0546541
3. Prefer..  |  -.0897029   .0497917    -1.80   0.072    -.1873333    .0079274
             |
    polviews |
 2. Liberal  |    .020629   .0236226     0.87   0.383    -.0256896    .0669476
3. Slight..  |   .0448706   .0265543     1.69   0.091    -.0071965    .0969377
4. Moderate  |   .0409804    .023257     1.76   0.078    -.0046214    .0865823
5. Slight..  |   .0283254   .0267319     1.06   0.289    -.0240898    .0807406
6. Conser..  |   .0085927   .0241611     0.36   0.722    -.0387818    .0559672
7. Very c..  |  -.0030302    .028901    -0.10   0.917    -.0596985    .0536381
8. Prefer..  |  -.0304942    .052236    -0.58   0.559    -.1329174     .071929
             |
  trust_govt |
2. Somewh..  |   .0105617   .0220034     0.48   0.631    -.0325819    .0537054
3. Neithe..  |  -.0103386   .0214375    -0.48   0.630    -.0523728    .0316955
4. Somewh..  |  -.0054783   .0215392    -0.25   0.799    -.0477118    .0367553
5. Strong..  |   .0505458    .029268     1.73   0.084    -.0068422    .1079339
             |
 cond_asthma |   -.003342   .0462584    -0.07   0.942    -.0940444    .0873605
   cond_lung |  -.0285062   .0545042    -0.52   0.601    -.1353766    .0783643
  cond_heart |   .0178148   .0482785     0.37   0.712    -.0768485    .1124782
cond_diabe~s |   .0515502   .0436217     1.18   0.237    -.0339822    .1370826
 cond_kidney |   -.066629   .0500787    -1.33   0.183    -.1648221    .0315642
cond_rathe~y |   .0613469   .1110261     0.55   0.581    -.1563504    .2790442
   cond_none |   .0263457   .0481043     0.55   0.584     -.067976    .1206674
       _cons |   .0497272   .1029066     0.48   0.629    -.1520496     .251504
------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
vaccine_co~t |        739    .1150203    .3192625          0          1

added scalar:
                 e(cm) =  .1150203
note: 3.covid_vacc_reaction omitted because of collinearity.
note: 3.flu_vacc_reaction omitted because of collinearity.

Linear regression                               Number of obs     =      2,988
                                                F(65, 2922)       =       1.97
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0457
                                                Root MSE          =     18.798

------------------------------------------------------------------------------
             |               Robust
 guess_delta | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
arm_industry |  -2.645848   .9562175    -2.77   0.006    -4.520776   -.7709193
arm_academic |  -1.510738   .9873394    -1.53   0.126     -3.44669    .4252133
arm_personal |  -2.326853   1.005793    -2.31   0.021    -4.298987   -.3547184
             |
prior_self~o |
2. Very u..  |   .6084968    1.02048     0.60   0.551    -1.392436     2.60943
3. Somewh..  |   -2.53601   1.220772    -2.08   0.038    -4.929671   -.1423498
4. Neithe..  |  -.8815182   1.769032    -0.50   0.618    -4.350193    2.587157
5. Somewh..  |  -3.070691   1.354677    -2.27   0.023    -5.726909   -.4144729
6. Very l..  |   .1656965   2.020567     0.08   0.935    -3.796183    4.127576
7. Would ..  |   -.156713   4.111881    -0.04   0.970    -8.219191    7.905765
             |
prior_self~c |
2. Very u..  |  -.6646055   2.233878    -0.30   0.766     -5.04474    3.715529
3. Somewh..  |   .9437609   2.232885     0.42   0.673    -3.434427    5.321949
4. Neithe..  |  -1.165493   2.429992    -0.48   0.632    -5.930164    3.599178
5. Somewh..  |   .9402708   2.187184     0.43   0.667    -3.348307    5.228849
6. Very l..  |   3.608677   2.343695     1.54   0.124    -.9867855    8.204139
7. Would ..  |   2.286508   2.835669     0.81   0.420    -3.273605     7.84662
             |
pre_vacc_i~e |
2. May or..  |   .1170696   .8119943     0.14   0.885     -1.47507    1.709209
had_p~d_vacc |   -.973316   1.425071    -0.68   0.495    -3.767562     1.82093
had_p~u_vacc |  -.0751921   1.797513    -0.04   0.967    -3.599712    3.449328
             |
covid_vacc~n |
1. None/d..  |  -1.459264   1.368716    -1.07   0.286    -4.143011    1.224482
2. Mild ..)  |   -1.30495   1.393213    -0.94   0.349     -4.03673     1.42683
  3. Severe  |          0  (omitted)
             |
flu_vacc_r~n |
1. None/d..  |   .5441215   1.812508     0.30   0.764      -3.0098    4.098043
2. Mild ..)  |  -.3819697   1.858725    -0.21   0.837    -4.026513    3.262574
  3. Severe  |          0  (omitted)
             |
         age |
   3. 35-49  |   2.007709   .8403916     2.39   0.017      .359889    3.655529
   4. 50-64  |   3.233976    1.02079     3.17   0.002     1.232435    5.235518
   5. 65-74  |   3.519813   1.723878     2.04   0.041     .1396743    6.899952
     6. 75+  |   7.995454   10.71325     0.75   0.456    -13.01083    29.00173
             |
      gender |
  2. Female  |   .5685427   .7475447     0.76   0.447    -.8972251     2.03431
   3. Other  |  -3.234449   3.185218    -1.02   0.310    -9.479949     3.01105
4. Prefer..  |  -6.281564   8.783183    -0.72   0.475    -23.50342    10.94029
             |
   education |
      2. HS  |  -1.586973   4.848269    -0.33   0.743    -11.09334    7.919398
3. Some c..  |   .9617393   4.801532     0.20   0.841    -8.452991    10.37647
4. 4-year..  |     .55061   4.813063     0.11   0.909    -8.886729    9.987949
5. More t..  |   .3519202   4.872877     0.07   0.942    -9.202702    9.906542
6. Prefer..  |  -.7515341    8.32773    -0.09   0.928    -17.08035    15.57728
             |
      income |
 2. $25-50k  |  -2.073588   1.234197    -1.68   0.093    -4.493572    .3463953
 3. $50-75k  |  -1.032389   1.211359    -0.85   0.394    -3.407593    1.342815
4. $75-100k  |  -2.280094   1.330482    -1.71   0.087    -4.888872    .3286839
  5. >$100k  |  -2.219953   1.223993    -1.81   0.070    -4.619928     .180023
6. Prefer..  |  -1.413937   2.938753    -0.48   0.630    -7.176174    4.348299
             |
        race |
   2. Black  |  -2.981104   1.134929    -2.63   0.009    -5.206445   -.7557623
   3. Asian  |  -.8656825   2.824279    -0.31   0.759    -6.403461    4.672096
4. Am Ind..  |   -1.45814   1.550736    -0.94   0.347    -4.498788    1.582507
5. Pacifi..  |   7.585358   5.376084     1.41   0.158     -2.95594    18.12666
   6. Other  |  -.7378119   2.200898    -0.34   0.737     -5.05328    3.577656
7. Prefer..  |   4.263007   3.868837     1.10   0.271    -3.322916    11.84893
             |
   ethnicity |
      2. No  |   .6329448   1.250336     0.51   0.613    -1.818683    3.084573
3. Prefer..  |  -1.098293   5.307534    -0.21   0.836    -11.50518    9.308593
             |
    polviews |
 2. Liberal  |  -1.031017   1.305602    -0.79   0.430    -3.591011    1.528978
3. Slight..  |  -.9133897    1.38982    -0.66   0.511    -3.638515    1.811735
4. Moderate  |  -2.120609   1.350754    -1.57   0.117    -4.769136    .5279186
5. Slight..  |   1.042329   1.538616     0.68   0.498    -1.974553    4.059211
6. Conser..  |   -1.86396   1.488434    -1.25   0.211    -4.782447    1.054526
7. Very c..  |  -3.414572   1.914092    -1.78   0.075    -7.167678    .3385353
8. Prefer..  |   -2.74956   3.631794    -0.76   0.449    -9.870694    4.371574
             |
  trust_govt |
2. Somewh..  |  -3.980433   1.460606    -2.73   0.006    -6.844354   -1.116512
3. Neithe..  |   -3.99222   1.366002    -2.92   0.003    -6.670644   -1.313796
4. Somewh..  |  -2.908815   1.362244    -2.14   0.033    -5.579869   -.2377597
5. Strong..  |  -4.509079   1.619044    -2.79   0.005    -7.683663   -1.334496
             |
 cond_asthma |   2.435397   3.218454     0.76   0.449    -3.875272    8.746065
   cond_lung |   .0054192   5.685645     0.00   0.999    -11.14286     11.1537
  cond_heart |  -3.138446   3.888798    -0.81   0.420    -10.76351    4.486616
cond_diabe~s |    3.52725   2.546853     1.38   0.166    -1.466559    8.521058
 cond_kidney |   2.114916   4.817745     0.44   0.661    -7.331604    11.56143
cond_rathe~y |   6.398722   7.609854     0.84   0.401    -8.522498    21.31994
   cond_none |     3.8102   3.283139     1.16   0.246      -2.6273     10.2477
       _cons |   .5142736   6.249622     0.08   0.934    -11.73984    12.76838
------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
 guess_delta |        739   -.3232747    18.95685        -82         92

added scalar:
                 e(cm) =  -.32327469

. 
. local coltitles mtitles("Placebo SE" "Placebo Correct" "Vaccine SE" "Vaccine 
> Correct" "SE Delta")

. 
. esttab m_guess_placebo m_placebo_correct m_guess_vaccine m_vaccine_correct m_
> guess_delta ///
>     using output/tables/persistence_adverse.tex, ///
>     b(%9.3f) se(%9.3f) keep(`keyvars') label nostar ///
>     stats(cm N, labels("Control mean" "N") fmt(%9.3f %9.0fc)) ///
>     fragment replace nomtitles nonotes nonumbers nolines nogaps
(output written to output/tables/persistence_adverse.tex)

. 
. esttab m_guess_placebo m_placebo_correct m_guess_vaccine m_vaccine_correct m_
> guess_delta ///
>     using output/tables/persistence_adverse.md, ///
>     b(%9.3f) se(%9.3f) keep(`keyvars') label nostar `coltitles' ///
>     stats(cm N, labels("Control mean" "N") fmt(%9.3f %9.0fc)) ///
>     fragment replace nonotes nonumbers
(output written to output/tables/persistence_adverse.md)

. 
. capture log close
