-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\sacks\Box\VaccSideEffects\output/logs/summary_stats_main.
> log
  log type:  text
 opened on:   9 Jan 2026, 20:57:04
.     di "=== Running in batch mode: $scriptname ==="
=== Running in batch mode: summary_stats_main ===
.     di "Log: output/logs/$scriptname.log"
Log: output/logs/summary_stats_main.log
.     di ""

. }

. 
end of do-file

. 
. * Load cleaned data
. use "data/main_clean.dta", clear

. 
. * Keep only valid observations
. keep if final_sample == 1
(100 observations deleted)

. count
  3,558

. local n_valid = r(N)

. 
. /*===========================================================================
> ===
>     EXPORT CONTINUOUS VARIABLE STATISTICS TO CSV
> =============================================================================
> =*/
. 
. file open contcsv using "output/tables/stats_main_continuous.csv", write repl
> ace
(file output/tables/stats_main_continuous.csv not found)

. file write contcsv "variable,n,mean,sd,min,p50,max" _n

. 
. * Continuous variables
. local cont_vars duration_sec post_trial posterior_novacc posterior_vacc delta
>  prior_diff

. 
. foreach var of local cont_vars {
  2.     summarize `var', detail
  3.     file write contcsv "`var'," (r(N)) "," (r(mean)) "," (r(sd)) "," (r(mi
> n)) "," (r(p50)) "," (r(max)) _n
  4. }

                  Survey duration (seconds)
-------------------------------------------------------------
      Percentiles      Smallest
 1%          118             35
 5%          159             38
10%          186             49       Obs               3,558
25%          239             53       Sum of wgt.       3,558

50%          317                      Mean           412.2063
                        Largest       Std. dev.      1056.275
75%          446           5507
90%          648           6390       Variance        1115716
95%          830          23087       Skewness       44.90358
99%         1474          56447       Kurtosis       2287.508

           Post-trial side effect estimate (0-100)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              0
 5%            2              0
10%            2              0       Obs               3,539
25%            3              0       Sum of wgt.       3,539

50%            6                      Mean           16.07514
                        Largest       Std. dev.      19.06262
75%           23             97
90%           45             97       Variance       363.3836
95%           60             97       Skewness       1.708116
99%           78             98       Kurtosis       5.327765

      Posterior: SE probability without vaccine (0-100)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               3,536
25%            1              0       Sum of wgt.       3,536

50%            3                      Mean           12.59384
                        Largest       Std. dev.      20.27688
75%           14            100
90%           45            100       Variance       411.1518
95%           60            100       Skewness       2.212791
99%           90            100       Kurtosis       7.416662

       Posterior: SE probability with vaccine (0-100)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              0
10%            2              0       Obs               3,530
25%            4              0       Sum of wgt.       3,530

50%           10                      Mean           25.70682
                        Largest       Std. dev.       28.0787
75%           45            100
90%           75            100       Variance       788.4135
95%           85            100       Skewness       1.100339
99%          100            100       Kurtosis       2.990527

            Posterior difference (vacc - novacc)
-------------------------------------------------------------
      Percentiles      Smallest
 1%          -47            -96
 5%          -10            -90
10%           -3            -80       Obs               3,530
25%            0            -80       Sum of wgt.       3,530

50%            3                      Mean            13.1825
                        Largest       Std. dev.      26.16768
75%           20            100
90%           52            100       Variance       684.7477
95%           75            100       Skewness       1.137735
99%           95            100       Kurtosis       5.095611

              Prior difference (vacc - placebo)
-------------------------------------------------------------
      Percentiles      Smallest
 1%           -3             -6
 5%           -1             -5
10%            0             -5       Obs               3,558
25%            0             -4       Sum of wgt.       3,558

50%            1                      Mean            1.52136
                        Largest       Std. dev.      1.963247
75%            3              6
90%            4              6       Variance       3.854337
95%            5              6       Skewness       .1795262
99%            6              6       Kurtosis       2.615507

. 
. file close contcsv

. 
. /*===========================================================================
> ===
>     EXPORT CATEGORICAL VARIABLE STATISTICS TO CSV
> =============================================================================
> =*/
. 
. file open catcsv using "output/tables/stats_main_categorical.csv", write repl
> ace
(file output/tables/stats_main_categorical.csv not found)

. file write catcsv "variable,value,n,pct" _n

. 
. * Helper program to write categorical stats
. capture program drop write_cat_stats

. program define write_cat_stats
  1.     args varname
  2. 
.     quietly levelsof `varname', local(levels)
  3.     quietly count if !mi(`varname')
  4.     local n_nonmiss = r(N)
  5. 
.     foreach val of local levels {
  6.         quietly count if `varname' == `val'
  7.         local n = r(N)
  8.         local pct = 100 * `n' / `n_nonmiss'
  9.         file write catcsv "`varname',`val'," (`n') "," (`pct') _n
 10.     }
 11. 
.     * Also write missing count if any
.     quietly count if mi(`varname')
 12.     if r(N) > 0 {
 13.         local n = r(N)
 14.         local pct = 100 * `n' / ($n_valid)
 15.         file write catcsv "`varname',.,`n',`pct'" _n
 16.     }
 17. end

. 
. * Store n_valid as global for use in program
. global n_valid = `n_valid'

. 
. * Loop over categorical variables
. # delimit ;
delimiter now ;
. local cat_vars
>     arm_n
>     prior_self_placebo prior_self_vacc
>     trust_trial relevant_trial trust_academic relevant_academic
>     vacc_intentions maybe
>     link_click link1_clicked link2_clicked link3_clicked link4_clicked
>     age gender education income race ethnicity polviews
>     incomplete failed_attn pid_mismatch duplicate_pid
>     arm_control arm_industry arm_academic arm_personal
> ;

. # delimit cr
delimiter now cr
. 
. foreach v of local cat_vars {
  2.     write_cat_stats `v'
  3.     tab `v'
  4. }

  Treatment |
        arm |
  (numeric) |      Freq.     Percent        Cum.
------------+-----------------------------------
 0. Control |        890       25.01       25.01
1. Industry |        890       25.01       50.03
2. Academic |        887       24.93       74.96
3. Personal |        891       25.04      100.00
------------+-----------------------------------
      Total |      3,558      100.00

   Prior belief: SE likelihood |
         without vaccine (1-7) |      Freq.     Percent        Cum.
-------------------------------+-----------------------------------
       1. Would definitely not |        749       21.05       21.05
              2. Very unlikely |      1,353       38.03       59.08
          3. Somewhat unlikely |        529       14.87       73.95
4. Neither likely nor unlikely |        238        6.69       80.64
            5. Somewhat likely |        446       12.54       93.17
                6. Very likely |        184        5.17       98.34
           7. Would definitely |         59        1.66      100.00
-------------------------------+-----------------------------------
                         Total |      3,558      100.00

   Prior belief: SE likelihood |
            with vaccine (1-7) |      Freq.     Percent        Cum.
-------------------------------+-----------------------------------
       1. Would definitely not |         98        2.75        2.75
              2. Very unlikely |        557       15.65       18.41
          3. Somewhat unlikely |        619       17.40       35.81
4. Neither likely nor unlikely |        371       10.43       46.23
            5. Somewhat likely |      1,098       30.86       77.09
                6. Very likely |        594       16.69       93.79
           7. Would definitely |        221        6.21      100.00
-------------------------------+-----------------------------------
                         Total |      3,558      100.00

   Trust in |
      trial |
information |
     (0-10) |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        196        5.56        5.56
          1 |         82        2.33        7.89
          2 |        189        5.36       13.25
          3 |        231        6.55       19.80
          4 |        287        8.14       27.94
          5 |        804       22.81       50.75
          6 |        448       12.71       63.46
          7 |        519       14.72       78.18
          8 |        479       13.59       91.77
          9 |        178        5.05       96.82
         10 |        112        3.18      100.00
------------+-----------------------------------
      Total |      3,525      100.00

  Relevance |
   of trial |
information |
     (0-10) |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        483       13.70       13.70
          1 |        153        4.34       18.04
          2 |        222        6.30       24.34
          3 |        230        6.52       30.87
          4 |        211        5.99       36.85
          5 |        578       16.40       53.25
          6 |        386       10.95       64.20
          7 |        447       12.68       76.88
          8 |        362       10.27       87.15
          9 |        232        6.58       93.73
         10 |        221        6.27      100.00
------------+-----------------------------------
      Total |      3,525      100.00

   Trust in |
   academic |
     source |
     (0-10) |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         80        4.54        4.54
          1 |         36        2.04        6.59
          2 |         58        3.29        9.88
          3 |         75        4.26       14.14
          4 |        122        6.93       21.07
          5 |        378       21.47       42.53
          6 |        235       13.34       55.88
          7 |        300       17.04       72.91
          8 |        271       15.39       88.30
          9 |        141        8.01       96.31
         10 |         65        3.69      100.00
------------+-----------------------------------
      Total |      1,761      100.00

  Relevance |
of academic |
     source |
     (0-10) |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        275       15.62       15.62
          1 |         74        4.20       19.82
          2 |        102        5.79       25.61
          3 |        117        6.64       32.25
          4 |        112        6.36       38.61
          5 |        261       14.82       53.44
          6 |        197       11.19       64.62
          7 |        215       12.21       76.83
          8 |        207       11.75       88.59
          9 |        107        6.08       94.66
         10 |         94        5.34      100.00
------------+-----------------------------------
      Total |      1,761      100.00

Flu vaccine intentions |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
-99. Prefer not to say |          1        0.03        0.03
  1. No, do not intend |      2,198       62.41       62.44
     2. May or may not |      1,031       29.27       91.71
      3. Intend to get |        225        6.39       98.10
        4. Already got |         67        1.90      100.00
-----------------------+-----------------------------------
                 Total |      3,522      100.00

Intends/alr |
   eady got |
    vaccine |      Freq.     Percent        Cum.
------------+-----------------------------------
      0. No |      3,230       91.71       91.71
     1. Yes |        292        8.29      100.00
------------+-----------------------------------
      Total |      3,522      100.00

   Any link |
    clicked |      Freq.     Percent        Cum.
------------+-----------------------------------
      0. No |      3,511       98.68       98.68
     1. Yes |         47        1.32      100.00
------------+-----------------------------------
      Total |      3,558      100.00

     Link 1 |
    clicked |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,535       99.35       99.35
          1 |         23        0.65      100.00
------------+-----------------------------------
      Total |      3,558      100.00

     Link 2 |
    clicked |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,537       99.41       99.41
          1 |         21        0.59      100.00
------------+-----------------------------------
      Total |      3,558      100.00

     Link 3 |
    clicked |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,541       99.52       99.52
          1 |         17        0.48      100.00
------------+-----------------------------------
      Total |      3,558      100.00

     Link 4 |
    clicked |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,547       99.69       99.69
          1 |         11        0.31      100.00
------------+-----------------------------------
      Total |      3,558      100.00

             Age group |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
-99. Prefer not to say |          1        0.03        0.03
              2. 18-34 |      1,185       33.65       33.67
              3. 35-49 |      1,405       39.89       73.57
              4. 50-64 |        777       22.06       95.63
              5. 65-74 |        147        4.17       99.80
                6. 75+ |          7        0.20      100.00
-----------------------+-----------------------------------
                 Total |      3,522      100.00

              Gender |      Freq.     Percent        Cum.
---------------------+-----------------------------------
             1. Male |      1,530       43.44       43.44
           2. Female |      1,949       55.34       98.78
            3. Other |         32        0.91       99.69
4. Prefer not to say |         11        0.31      100.00
---------------------+-----------------------------------
               Total |      3,522      100.00

     Education level |      Freq.     Percent        Cum.
---------------------+-----------------------------------
     1. Less than HS |         19        0.54        0.54
               2. HS |        517       14.68       15.22
     3. Some college |      1,171       33.25       48.47
    4. 4-year degree |      1,285       36.48       84.95
 5. More than 4-year |        517       14.68       99.63
6. Prefer not to say |         13        0.37      100.00
---------------------+-----------------------------------
               Total |      3,522      100.00

    Household income |      Freq.     Percent        Cum.
---------------------+-----------------------------------
            1. <$25k |        489       13.88       13.88
          2. $25-50k |        787       22.35       36.23
          3. $50-75k |        743       21.10       57.33
         4. $75-100k |        558       15.84       73.17
           5. >$100k |        858       24.36       97.53
6. Prefer not to say |         87        2.47      100.00
---------------------+-----------------------------------
               Total |      3,522      100.00

                      Race |      Freq.     Percent        Cum.
---------------------------+-----------------------------------
                  1. White |      2,648       75.18       75.18
                  2. Black |        478       13.57       88.76
                  3. Asian |         25        0.71       89.47
4. Am Indian/Alaska Native |        206        5.85       95.32
       5. Pacific Islander |          6        0.17       95.49
                  6. Other |        129        3.66       99.15
      7. Prefer not to say |         30        0.85      100.00
---------------------------+-----------------------------------
                     Total |      3,522      100.00

     Hispanic/Latino |      Freq.     Percent        Cum.
---------------------+-----------------------------------
              1. Yes |        323        9.17        9.17
               2. No |      3,173       90.09       99.26
3. Prefer not to say |         26        0.74      100.00
---------------------+-----------------------------------
               Total |      3,522      100.00

         Political views |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
         1. Very liberal |        331        9.40        9.40
              2. Liberal |        618       17.55       26.94
     3. Slightly liberal |        428       12.15       39.10
             4. Moderate |        811       23.03       62.12
5. Slightly conservative |        397       11.27       73.40
         6. Conservative |        638       18.11       91.51
    7. Very conservative |        260        7.38       98.89
    8. Prefer not to say |         39        1.11      100.00
-------------------------+-----------------------------------
                   Total |      3,522      100.00

 Incomplete |
   response |      Freq.     Percent        Cum.
------------+-----------------------------------
      0. No |      3,518       98.88       98.88
     1. Yes |         40        1.12      100.00
------------+-----------------------------------
      Total |      3,558      100.00

     Failed |
  attention |
      check |      Freq.     Percent        Cum.
------------+-----------------------------------
      0. No |      3,558      100.00      100.00
------------+-----------------------------------
      Total |      3,558      100.00

   Prolific |
        PID |
   mismatch |      Freq.     Percent        Cum.
------------+-----------------------------------
      0. No |      3,556       99.94       99.94
     1. Yes |          2        0.06      100.00
------------+-----------------------------------
      Total |      3,558      100.00

  Duplicate |
   Prolific |
        PID |      Freq.     Percent        Cum.
------------+-----------------------------------
      0. No |      3,558      100.00      100.00
------------+-----------------------------------
      Total |      3,558      100.00

 Treatment: |
control arm |      Freq.     Percent        Cum.
------------+-----------------------------------
      0. No |      2,668       74.99       74.99
     1. Yes |        890       25.01      100.00
------------+-----------------------------------
      Total |      3,558      100.00

 Treatment: |
   industry |
        arm |      Freq.     Percent        Cum.
------------+-----------------------------------
      0. No |      2,668       74.99       74.99
     1. Yes |        890       25.01      100.00
------------+-----------------------------------
      Total |      3,558      100.00

 Treatment: |
   academic |
        arm |      Freq.     Percent        Cum.
------------+-----------------------------------
      0. No |      2,671       75.07       75.07
     1. Yes |        887       24.93      100.00
------------+-----------------------------------
      Total |      3,558      100.00

 Treatment: |
   personal |
        arm |      Freq.     Percent        Cum.
------------+-----------------------------------
      0. No |      2,667       74.96       74.96
     1. Yes |        891       25.04      100.00
------------+-----------------------------------
      Total |      3,558      100.00

. 
. file close catcsv

. capture log close
