-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/sacks/Projects/VaccSideEffects/output/logs/test_regression_
> table.log
  log type:  text
 opened on:  22 Jan 2026, 13:08:26
.     di "=== Running in batch mode: $scriptname ==="
=== Running in batch mode: test_regression_table ===
.     di "Log: output/logs/$scriptname.log"
Log: output/logs/test_regression_table.log
.     di ""

. }

. 
end of do-file

. 
. /*---------------------------------------------------------------------------
> ---
>     Test Case 1: Deterministic regression table
> -----------------------------------------------------------------------------
> -*/
. 
. di ""


. di "=============================================="
==============================================

. di "=== TEST CASE 1: Deterministic regression"
=== TEST CASE 1: Deterministic regression

. di "=============================================="
==============================================

. 
. clear

. input arm_a arm_b y1 y2 x

         arm_a      arm_b         y1         y2          x
  1. 0 0 10 5 1
  2. 0 0 10 5 1
  3. 1 0 12 6 1
  4. 1 0 12 6 1
  5. 0 1 11 4 1
  6. 0 1 11 4 1
  7. end

. label var arm_a "Treatment A"

. label var arm_b "Treatment B"

. 
. regression_table y1 y2, keyvars(arm_a arm_b) controls(x) ///
>     saving(output/tables/test_regression_basic.tex)

=== Regression: y1 ===

=== Regression: y2 ===

Regression Table
-------------------------------------------------------------------------------
                              y1          y2
-------------------------------------------------------------------------------
Treatment A                2.000       1.000
                        ( 0.000)    ( 0.000)
Treatment B                1.000      -1.000
                        ( 0.000)    ( 0.000)
-------------------------------------------------------------------------------
Control mean              10.000       5.000
N                              6           6
-------------------------------------------------------------------------------
Saved: output/tables/test_regression_basic.tex

. 
. * Verify output
. di ""


. di "=== Verifying output ==="
=== Verifying output ===

. type output/tables/test_regression_basic.tex
Treatment A &     2.000 &     1.000 \\
                & (  0.000) & (  0.000) \\
Treatment B &     1.000 &    -1.000 \\
                & (  0.000) & (  0.000) \\
Control mean    &    10.000 &     5.000 \\
N               & 6 & 6

. 
. di ""


. di "Expected coefficients (exact due to perfect fit):"
Expected coefficients (exact due to perfect fit):

. di "  y1: arm_a = 2.000, arm_b = 1.000, control mean = 10.000"
  y1: arm_a = 2.000, arm_b = 1.000, control mean = 10.000

. di "  y2: arm_a = 1.000, arm_b = -1.000, control mean = 5.000"
  y2: arm_a = 1.000, arm_b = -1.000, control mean = 5.000

. di "  N = 6 for both"
  N = 6 for both

. 
. /*---------------------------------------------------------------------------
> ---
>     Test Case 2: Regression with if condition
> -----------------------------------------------------------------------------
> -*/
. 
. di ""


. di "=============================================="
==============================================

. di "=== TEST CASE 2: With if condition"
=== TEST CASE 2: With if condition

. di "=============================================="
==============================================

. 
. clear

. input arm_a y1 insample

         arm_a         y1   insample
  1. 0 10 1
  2. 0 10 1
  3. 1 12 1
  4. 1 12 0
  5. end

. label var arm_a "Treatment A"

. 
. di "Full sample: N=4, arm_a coef = 2.0"
Full sample: N=4, arm_a coef = 2.0

. di "Restricted (insample==1): N=3, arm_a coef = 2.0"
Restricted (insample==1): N=3, arm_a coef = 2.0

. 
. regression_table y1 if insample==1, keyvars(arm_a) ///
>     saving(output/tables/test_regression_if.tex)

=== Regression: y1 ===

Regression Table
-------------------------------------------------------------------------------
                              y1
-------------------------------------------------------------------------------
Treatment A                2.000
                        ( 0.000)
-------------------------------------------------------------------------------
Control mean              10.000
N                              3
-------------------------------------------------------------------------------
Saved: output/tables/test_regression_if.tex

. 
. * Verify output
. di ""


. di "=== Verifying output ==="
=== Verifying output ===

. type output/tables/test_regression_if.tex
Treatment A &     2.000 \\
                & (  0.000) \\
Control mean    &    10.000 \\
N               & 3

. 
. di ""


. di "Expected: N = 3, arm_a = 2.000, control mean = 10.000"
Expected: N = 3, arm_a = 2.000, control mean = 10.000

. 
. /*---------------------------------------------------------------------------
> ---
>     Test Case 3: Single outcome
> -----------------------------------------------------------------------------
> -*/
. 
. di ""


. di "=============================================="
==============================================

. di "=== TEST CASE 3: Single outcome"
=== TEST CASE 3: Single outcome

. di "=============================================="
==============================================

. 
. clear

. input arm_a arm_b y1

         arm_a      arm_b         y1
  1. 0 0 5
  2. 0 0 5
  3. 1 0 8
  4. 1 0 8
  5. 0 1 6
  6. 0 1 6
  7. end

. label var arm_a "Treatment A"

. label var arm_b "Treatment B"

. 
. regression_table y1, keyvars(arm_a arm_b) saving(output/tables/test_regressio
> n_single.tex)

=== Regression: y1 ===

Regression Table
-------------------------------------------------------------------------------
                              y1
-------------------------------------------------------------------------------
Treatment A                3.000
                        ( 0.000)
Treatment B                1.000
                        ( 0.000)
-------------------------------------------------------------------------------
Control mean               5.000
N                              6
-------------------------------------------------------------------------------
Saved: output/tables/test_regression_single.tex

. 
. * Verify output
. di ""


. di "=== Verifying output ==="
=== Verifying output ===

. type output/tables/test_regression_single.tex
Treatment A &     3.000 \\
                & (  0.000) \\
Treatment B &     1.000 \\
                & (  0.000) \\
Control mean    &     5.000 \\
N               & 6

. 
. di ""


. di "Expected: arm_a = 3.000, arm_b = 1.000, control mean = 5.000, N = 6"
Expected: arm_a = 3.000, arm_b = 1.000, control mean = 5.000, N = 6

. 
. /*---------------------------------------------------------------------------
> ---
>     Test Case 4: Replicate existing treatment_effects.do output
> -----------------------------------------------------------------------------
> -*/
. 
. di ""


. di "=============================================="
==============================================

. di "=== TEST CASE 4: Replicate treatment_effects.do"
=== TEST CASE 4: Replicate treatment_effects.do

. di "=============================================="
==============================================

. 
. use "derived/merged_all.dta", clear

. do "code/_set_controls.do"

. /*===========================================================================
> ===
>     Control Variables Definition
> 
>     Include this file in do-files that run regressions with control variables
> .
>     Sets globals: prior_beliefs, vacc_experience, demographics, controls
> =============================================================================
> =*/
. 
. * Prior beliefs from main survey
. global prior_beliefs "i.prior_self_placebo i.prior_self_vacc"

. 
. * Vaccine experiences from prescreen
. global vacc_experience "had_prior_covid_vacc had_prior_flu_vacc i.covid_vacc_
> reaction i.flu_vacc_reaction"

. 
. * Demographics from main survey
. global demographics "i.age i.gender i.education i.income i.race i.ethnicity i
> .polviews"

. 
. * All controls combined
. global controls "$prior_beliefs i.pre_vacc_intent $vacc_experience $demograph
> ics i.trust_govt cond_*"

. 
end of do-file

. 
. * Create link_click if not already present
. capture confirm variable link_click

. if _rc {
.     egen link_click = rowmax(link1_clicked link2_clicked link3_clicked link4_
> clicked)
.     label var link_click "Any link clicked"
. }

. 
. * Convert -99 to missing for categorical variables
. foreach var in age gender education income race ethnicity {
  2.     replace `var' = . if `var' == -99
  3. }
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)

. 
. * Create vacc_post outcome
. gen vacc_post = got_flu_vacc == 1 | flu_why_already == 1 if ~missing(got_flu_
> vacc)
(536 missing values generated)

. 
. * Label treatment indicators
. label var arm_industry "Industry"

. label var arm_academic "Academic"

. label var arm_personal "Personal"

. 
. regression_table post_trial delta main_maybe link_click vacc_post, ///
>     keyvars(arm_industry arm_academic arm_personal) ///
>     controls($controls) saving(output/tables/test_replicate_treatment.tex)

=== Regression: post_trial ===

=== Regression: delta ===

=== Regression: main_maybe ===

=== Regression: link_click ===

=== Regression: vacc_post ===

Regression Table
-------------------------------------------------------------------------------
                      post_trial       delta  main_maybe  link_click   vacc_pos
> t
-------------------------------------------------------------------------------
Industry                  -7.971      -3.303      -0.000      -0.002      -0.01
> 4
                        ( 0.853)    ( 1.022)    ( 0.012)    ( 0.006)    ( 0.013
> )
Academic                  -4.392      -2.857       0.031      -0.003       0.02
> 1
                        ( 0.874)    ( 1.010)    ( 0.013)    ( 0.006)    ( 0.015
> )
Personal                  -4.728       0.387       0.024      -0.002       0.01
> 8
                        ( 0.878)    ( 1.018)    ( 0.013)    ( 0.006)    ( 0.014
> )
-------------------------------------------------------------------------------
Control mean              20.193      15.410       0.069       0.015       0.08
> 3
N                          3,516       3,516       3,516       3,516       2,99
> 2
-------------------------------------------------------------------------------
Saved: output/tables/test_replicate_treatment.tex

. 
. di ""


. di "Compare output/tables/test_replicate_treatment.tex with output/tables/tre
> atment_effects.tex"
Compare output/tables/test_replicate_treatment.tex with output/tables/treatment
> _effects.tex

. di "Values should match within floating point precision"
Values should match within floating point precision

. di ""


. di "Note: treatment_effects.tex includes R-squared row which our command omit
> s"
Note: treatment_effects.tex includes R-squared row which our command omits

. 
. /*---------------------------------------------------------------------------
> ---
>     Summary
> -----------------------------------------------------------------------------
> -*/
. 
. di ""


. di "=============================================="
==============================================

. di "=== TEST SUMMARY ==="
=== TEST SUMMARY ===

. di "=============================================="
==============================================

. di "Test files created:"
Test files created:

. di "  - output/tables/test_regression_basic.tex"
  - output/tables/test_regression_basic.tex

. di "  - output/tables/test_regression_if.tex"
  - output/tables/test_regression_if.tex

. di "  - output/tables/test_regression_single.tex"
  - output/tables/test_regression_single.tex

. di "  - output/tables/test_replicate_treatment.tex"
  - output/tables/test_replicate_treatment.tex

. di ""


. di "Review output and compare test_replicate_treatment.tex with treatment_eff
> ects.tex"
Review output and compare test_replicate_treatment.tex with treatment_effects.t
> ex

. 
. capture log close
