--------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\dwsacks\Box\VaccSideEffects\logs/trust_relevance.log
  log type:  text
 opened on:  15 Nov 2025, 09:07:57

. 
. tab trust_trial if hesitant == 1

          trust_trial |      Freq.     Percent        Cum.
----------------------+-----------------------------------
1. very untrustworthy |          3        3.12        3.12
     2. untrustworthy |         10       10.42       13.54
           3. neither |         32       33.33       46.88
       4. trustworthy |         50       52.08       98.96
  5. very trustworthy |          1        1.04      100.00
----------------------+-----------------------------------
                Total |         96      100.00

. tab relevant_trial if hesitant == 1

relevant_tria |
            l |      Freq.     Percent        Cum.
--------------+-----------------------------------
0. Not at all |         30       31.25       31.25
  1. Slightly |         44       45.83       77.08
  2. Relevant |         18       18.75       95.83
      3. Very |          4        4.17      100.00
--------------+-----------------------------------
        Total |         96      100.00

. tab trust_academic if hesitant == 1

       trust_academic |      Freq.     Percent        Cum.
----------------------+-----------------------------------
1. very untrustworthy |          1        4.35        4.35
     2. untrustworthy |          3       13.04       17.39
           3. neither |          6       26.09       43.48
       4. trustworthy |         11       47.83       91.30
  5. very trustworthy |          2        8.70      100.00
----------------------+-----------------------------------
                Total |         23      100.00

. tab relevant_academic  if hesitant == 1

relevant_acad |
         emic |      Freq.     Percent        Cum.
--------------+-----------------------------------
0. Not at all |         10       43.48       43.48
  1. Slightly |          8       34.78       78.26
  2. Relevant |          4       17.39       95.65
      3. Very |          1        4.35      100.00
--------------+-----------------------------------
        Total |         23      100.00

. 
. tab trust_trial if hesitant == 0

          trust_trial |      Freq.     Percent        Cum.
----------------------+-----------------------------------
1. very untrustworthy |          1        0.96        0.96
     2. untrustworthy |          1        0.96        1.92
           3. neither |         30       28.85       30.77
       4. trustworthy |         58       55.77       86.54
  5. very trustworthy |         14       13.46      100.00
----------------------+-----------------------------------
                Total |        104      100.00

. tab relevant_trial if hesitant == 0

relevant_tria |
            l |      Freq.     Percent        Cum.
--------------+-----------------------------------
0. Not at all |          8        7.69        7.69
  1. Slightly |         37       35.58       43.27
  2. Relevant |         42       40.38       83.65
      3. Very |         17       16.35      100.00
--------------+-----------------------------------
        Total |        104      100.00

. tab trust_academic if hesitant == 0

       trust_academic |      Freq.     Percent        Cum.
----------------------+-----------------------------------
     2. untrustworthy |          1        3.85        3.85
           3. neither |          9       34.62       38.46
       4. trustworthy |         11       42.31       80.77
  5. very trustworthy |          5       19.23      100.00
----------------------+-----------------------------------
                Total |         26      100.00

. tab relevant_academic  if hesitant == 0

relevant_acad |
         emic |      Freq.     Percent        Cum.
--------------+-----------------------------------
0. Not at all |          2        7.69        7.69
  1. Slightly |         11       42.31       50.00
  2. Relevant |         11       42.31       92.31
      3. Very |          2        7.69      100.00
--------------+-----------------------------------
        Total |         26      100.00

. 
. log close 
      name:  <unnamed>
       log:  C:\Users\dwsacks\Box\VaccSideEffects\logs/trust_relevance.log
  log type:  text
 closed on:  15 Nov 2025, 09:07:57
--------------------------------------------------------------------------------------------------
